/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_point.h                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/05/12 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/10/16 11:46:33 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex03/
**  Файлы для сдачи: ft_point.h
**  Разрешенные функции: отсутствуют
**
** ************************************************************************** **
**  
**  
**  - Создайте файл ft_point.h, который скомпилирует следующий файл 'main' :
--------------------------------------------------------------------------------

    #include "ft_point.h"

    void	set_point(t_point *point)
    {
        point->x = 42;
        point->y = 21;
    }

    int		main(void)
    {
        t_point		point;

        set_point(&point);
        return (0);
    }

--------------------------------------------------------------------------------
** 
**
** ************************************************************************** **
**
**  Так же, ТУТ ВСЁ О "struct":
**                                              https://youtu.be/hoHAOTVRndc
**                                              https://youtu.be/6ooPdvzhhJw
**                          http://www.mir-koda.ru/full_leson_cpp.php?id=20
**                          http://www.mir-koda.ru/full_leson_cpp.php?id=21
**
**  ОБЯЗАТЕЛЬНО к ПРОЧТЕНИЮ:
**                          http://www.youngcoder.net/2015/01/structury1.html
**                                              https://prog-cpp.ru/c-struct/
**
** ************************************************************************** **
**
**  Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую
**
** ************************************************************************** */
/* ************************************************************************** */


#ifndef FT_POINT_H
# define FT_POINT_H

typedef struct	s_point
{
	int x;
	int y;
}				t_point;

void			set_point(t_point *point);

#endif


/* ************************************************************************** */
/* ************************************************************************** */



#ifndef __FT_POINT_H
# define __FT_POINT_H

typedef struct	s_point
{
	int	x;
	int	y;
}				t_point;

void			set_point(t_point *point);

#endif

/* ************************************************************************** */
/* ************************************************************************** */
