/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_compact.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* 
 * ===-----------------------------------------------------------------------===
 *
 *	• Напишите функцию ft_compact, которая примет массив параметра char * и 
 *	перезапишет все элементы, которые указывают на 0.
 *	
 *	• Эта функция будет прототипирована следующим образом:
 *										int	ft_compact(char  *tab, int length)
 *	
 *	• Эта функция вернет новый размер массива
 *
 *	• Не уверен, что вы понимаете, что делает эта функция? Она существует в Ruby.
 *
 * ===-----------------------------------------------------------------------===
 */


int	size_tab(char **tab)
{
	int	i;

	i = 0;
	while (tab[i] != ((void *)0))
		i++;
	return (i);
}

int	ft_compact(char **tab, int length)
{
	int	i;
	int	j;
	int	k;

	i = 0;
	length = 0;
	while (tab[i])
	{
		if (tab[i] == ((void *)0))
		{
			k = 0;
			while (tab[i + 1 + k])
			{
				j = 0;
				while (tab[i + 1 + k][j])
				{
					tab[i + k][j] = tab[i + 1 + k][j];
					j++;
				}
				k++;
			}
		}
		i++;
	}
	return (size_tab(tab));
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */



void	remove_element(char *array, int index, int array_length)
{
	int i;

	i = index;
	while (i < array_length - 1)
	{
		array[i] = array[i + 1];
		i++;
	}
}

int		ft_compact(char **tab, int length)
{
	int i;

	i = 0;
	while (tab[i])
	{
		if (!tab[i])
		{
			remove_element(**tab, i, length);
			length--;
		}
		i++;
	}
	return (length);
}



/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */




int		ft_compact(char **tab, int length)
{
	int		i;
	int		j;

	i = 0;
	while (i < length)
	{
		while (*(tab + i))
			i++;
		j = i;
		length--;
		while (j < length)
		{
			*(tab + j) = *(tab + j + 1);
			j++;
		}
	}
	return (length);
}





/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */
