/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putstr_non_printable.c                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/10/19 14:43:12 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** 
**
**
**  • Создайте функцию, которая отображает строку символов на экране. Если
**  эта строка  содержит символы, которые не могут быть напечатаны, они должны
**  отображаться в  форме шестнадцатеричных символов (нижний регистр), перед
**  которыми стоит «обратный слеш» '\'.
**
**
**  •  Например, если функция получит в аргументах вот эту строку :
--------------------------------------------------------------------------------

    Coucou\ntu vas bien ?

--------------------------------------------------------------------------------
**
**
**  •  То она должна напечатать эту строку вот так. Заменив непечатаемый 
**  символ '\n'  шестнадцатиричными символами '\0a,' отражающими код 
**  непечатаемого символа :
--------------------------------------------------------------------------------

    Coucou\0atu vas bien ?
	
--------------------------------------------------------------------------------
**
**
**  •  Ваша функция должна быть объявлена ​​следующим образом:
**
**  int		ft_putstr_non_printable(char *str);
** 
** 
**
** ************************************************************************** **
**
**
** Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую
**
**
** ************************************************************************** */
/* ************************************************************************** */

void		ft_putchar(char c)
{
	write(1, &c, 1);
}

void		ft_putstr_non_printable(char *str)
{
	int		i;
	char	*hex;

	hex = "0123456789abcdef";
	i = 0;
	if(check_base(hex))
	{
		while (str[i])
		{
			if ((str[i] < 32 && str[i] >= 0) || str[i] == 127)
			{
				ft_putchar('\\');
				if (str[i] < 16)
				{
					ft_putchar('0');
					ft_putchar(hex[(int)str[i]]);
				}
				else
				{
					ft_putchar(hex[str[i]/16]);
					ft_putchar(hex[str[i]%16]);
				}
				
			}
			else
				ft_putchar(str[i]);
			i++;
		}
	}
}



/* ************************************************************************** */
/* ************************************************************************** */


void		ft_putchar(char c)
{
	write(1, &c, 1);
}


static void	ft_print_hexa(char np, char *hex)
{
	if (np > 16)
	{
		ft_print_hexa(np / 16, hex);
		ft_print_hexa(np % 16, hex);
	}
	else
		ft_putchar(hex[np]);
}

void		ft_putstr_non_printable(char *str)
{
	int		i;
	char	*hex;

	hex = "0123456789abcdef";
	i = 0;
	while (str[i])
	{
		if ((str[i] < 32 && str[i] >= 0) || str[i] == 127)
		{
			ft_putchar('\\');
			if (str[i] < 16)
				ft_putchar('0');
			ft_print_hexa(str[i], hex);
		}
		else
			ft_putchar(str[i]);
		i++;
	}
}


/* ************************************************************************** */
/* ************************************************************************** */


void		ft_putchar(char c)
{
	write(1, &c, 1);
}

int		is_pr5(char c)
{
	return ((c >= 32) && (c <= 126));
}

void	ft_puthex_digit(char c)
{
	if (c < 10)
	{
		ft_putchar('0' + c);
	}
	else
	{
		ft_putchar('a' - 10 + c);
	}
}

void	putchar_non_printable(char c)
{
	int n;

	if (is_pr5(c))
		ft_putchar(c);
	else
	{
		if (c < 0)
			n = c + 256;
		else
			n = c;
		ft_putchar('\\');
		ft_puthex_digit(n / 16);
		ft_puthex_digit(n % 16);
	}
}

void	ft_putstr_non_printable(char *str)
{
	while (*str)
		putchar_non_printable(*(str++));
}