/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   btree_search_item.c                                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/11/17 17:44:37 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex05/
**  Файлы для сдачи: btree_search_item.c, ft_btree.h	
**  Разрешенные функции: Никакие
**
** ************************************************************************** **
**
** 
**	• Создайте функцию 'btree_search_item', которая возвращает первый элемент, 
**  связанный со справочными данными, указанными в качестве аргумента. Дерево 
**  следует просматривать, используя инфиксный обход. Если элемент не найден, 
**  функция должна вернуть 'NULL'.
** 
** 
**	• Вот как эта функция должна быть объявлена:
**
**	void *btree_search_item(t_btree *root, void *data_ref, int (*cmpf)(void *, void *));
** 
** 
** ************************************************************************** */
/* ************************************************************************** */

#include "ft_btree.h"

void	*btree_search_item(t_btree *root, void *data_ref, \
							int (*cmpf)(void *, void *))
{
	void	*out;

	out = ((void *)0);
	if (root)
	{
		out = btree_search_item(root->left, data_ref, cmpf);
		if (!out && !((*cmpf)(root->item, data_ref)))
			out = root->item;
		if (!out)
			out = btree_search_item(root->right, data_ref, cmpf);
	}
	return (out);
}
