/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_is_negative.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: adespond <adespond@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2015/09/03 11:16:41 by adespond          #+#    #+#             */
/*   Updated: 2015/09/03 12:31:19 by adespond         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* - Create a function that displays ’N’ or ’P’ depending on the integer’s sign entered as a parameter. If n is negative, display ’N’. If n is positive or null, display ’P’. */

/* - Создайте функцию, которая отображает «N» или «P» в зависимости от целочисленного знака, введенного в качестве параметра. Если n отрицательно, выведите «N». Если n является положительным или нулевым, выведите «P». */

/* Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую */

/* ************************************************************************** */

int		ft_putchar(char c);

/* ************************************************************************** */


void	ft_is_negative(int n)
{
	if (n < 0)
		ft_putchar('N');
	else
		ft_putchar('P');
}


/* ************************************************************************** */
