/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_list_at.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/11/16 14:55:42 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex07/
**  Файлы для сдачи: ft_list_at.c, ft_list.h
**  Разрешенные функции: Никаких
**
** ************************************************************************** **
**
** 
**  • Создайте функцию "ft_list_at", которая возвращает N-й элемент списка, зная,
**  что первый элемент списка имеет значение, когда nbr равно 0.
**	
**
**	• В случае ошибки он должен возвращать нулевой указатель.
**
** 
**	• Вот как эта функция должна быть объявлена :
**
**					t_list	*ft_list_at(t_list**begin_list, unsigned int nbr);
** 
** 
** ************************************************************************** */
/* ************************************************************************** */

#include "ft_list.h"

t_list		*ft_list_at(t_list *begin_list, unsigned int nbr)
{
	unsigned int	i;

	if (nbr == 0)
		return ((void *)0);
	i = 1;
	while (i < nbr)
	{
		if (begin_list->next)
			begin_list = begin_list->next;
		else
			return ((void *)0);
		i++;
	}
	return (begin_list);
}


/* ************************************************************************** */
/* ************************************************************************** */


#include "ft_list.h"

t_list	*ft_list_at(t_list *begin_list, unsigned int nbr)
{
	unsigned int	i;

	if (nbr == 0)
		return ((void *)0);
	i = 1;
	while (i < nbr)
	{
		if (!begin_list)
			return ((void *)0);
		begin_list = begin_list->next;
		i++;
	}
	return (begin_list);
}


/* ************************************************************************** */
/* ************************************************************************** */


#include "ft_list.h"

t_list	*ft_list_at(t_list *begin_list, unsigned int nbr)
{
	if (!begin_list)
		return ((void *)0);
	if (!nbr)
		return (begin_list);
	return (ft_list_at(begin_list->next, nbr - 1));
}


/* ************************************************************************** */
/* ************************************************************************** */
