/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_iterative_power.c                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/10/10 15:27:40 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**  
**  
**  - Создайте итерационную функцию, которая возвращает значение степени, 
**  примененной к числу. Мощность ниже 0 возвращает 0. Переполнения не должны
**  быть обработаны.
**
**  - Мы решили, что 0 в степени 0 вернет 1.
**  
**   
**  - Ваша функция должна быть объявлена ​​следующим образом:
**  
**  	int	ft_iterative_power(int nb, int power);
**  
**  
** ************************************************************************** **
**
**  Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую
**
** ************************************************************************** */
/* ************************************************************************** */


int	ft_iterative_power(int nb, int power)
{
	int	result;

	result = 1;
	if (power < 0)
		return (0);
	if (power == 0)
		return (1);
	while (power)
	{
		result *= nb;
		power--;
	}
	return (result);
}

/* ************************************************************************** */
/* ************************************************************************** */

int		ft_iterative_power(int nb, int power)
{
	int	i;
	int	p;

	if (power < 0)
		return (0);
	if (power == 0)
		return (1);
	i = 0;
	p = nb;
	while (++i < power)
		p = p * nb;
	return (p);
}

/* ************************************************************************** */
/* ************************************************************************** */

int	ft_iterative_power(int nb, int power)
{
	int init;

	if (power < 0)
		return (0);
	if (power == 0)
		return (1);
	init = nb;
	while (power > 1)
	{
		init *= nb;
		power--;
	}
	return (nb);
}

/* ************************************************************************** */
/* ************************************************************************** */

int		ft_iterative_power(int nb, int power)
{
	int result;

	if (power < 0)
		return (0);
	if (power == 0)
		return (1);
	result = nb;
	while (power > 1)
	{
		result = result * nb;
		power--;
	}
	return (result);
}

/* ************************************************************************** */
/* ************************************************************************** */

int		ft_iterative_power(int nb, int power)
{
	int result;

	result = 1;
	if (power < 0)
		return (0);
	if (power == 0)
		return (1);
	while (power--)
		result *= nb;
	return (result);
}

/* ************************************************************************** */
/* ************************************************************************** */
