/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/10/10 15:28:06 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/*         команда для компиляции и одновременного запуска                    */
/*                                                                            */
/*  gcc -Wall -Werror -Wextra test.c && chmod +x ./a.out && ./a.out           */
/* ************************************************************************** */


#include <unistd.h>

/* ************************************************************************** */
/* ************************************************************************** */

void	ft_putchar(char c)			/* функция вывода символа */
{
	write(1, &c, 1);
}

/* ************************************************************************** */
/* ************************************************************************** */

void	ft_putnbr(int nb)
{
	int	temp;
	int	size;

	size = 1;
	if (nb < 0)
	{
		ft_putchar('-');
		nb = -nb;
	}
	if (nb == -2147483648)
	{	
		ft_putchar('2');
		nb = 147483648;
	}
	temp = nb;
	while ((temp /= 10) > 0)
		size *= 10;
	temp = nb;
	while (size)
	{
		ft_putchar((char)((temp / size)) + 48);
		temp %= size;
		size /= 10;
	}
}

/* ************************************************************************** */
/* ************************************************************************** */

int		ft_iterative_power(int nb, int power)/* Функция возведения в степень */
{
	int	result;								/* обьявляем переменную для хранения добытого результата */

	result = 1;								/* инициализируем ее единицей для начала вычислений результата возведения в степень */
	if(power < 0)							/* Проверяем соответствует ли число в степени условиям */
		return (0);							/* Если не соответствует то завершаем функцию и возвращаем ноль */
	if(power == 0)							/* Проверяем соответствует ли число в степени условиям */
		return (1);							/* Если не соответствует то завершаем функцию и возвращаем ноль */
	while (power--)							/* Запускаем цикл который умножит переменную 'result' на 'nb' столько раз сколько записано в 'power'. Возведет в 'nb' в степень 'power'. */
		result *= nb;						/* Умножая 'result' на 'nb' и сохраняя результат в той же переменной 'result' столько раз сколько записано в 'power'  
											 * мы сможем получить результат возведения в степень 'power' числа 'nb'. */
	return (result);						/* Завершаем функцию и возвращаем результат возведения в степень */
}

/* ************************************************************************** */
/* ************************************************************************** */

int 	main(void)
{
	int r;

	r = ft_iterative_power(15,2);

	ft_putnbr(r);

	return (0);
}
