/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_ultimate_ft.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/02/16 23:30:07 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex01/
**  Файлы для сдачи: ft_ultimate_ft.c	
**  Разрешенные функции: отсутствуют
**
** ************************************************************************** **
**
**
** Создайте функцию, которая принимает "указатель на указатель на указатель на
** указатель на указатель на указатель на указатель на указатель на указатель на
** указатель на указатель" на 'int' в качестве параметра и устанавливает значение
** " 42 " для этого 'int'.
**
**
**  - Вот как это должно быть обьявлено:
**
**          void	ft_ultimate_ft(int *********nbr);
**
**
** ************************************************************************** **
**
**  Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую
**
** ************************************************************************** */
/* ************************************************************************** */


void	ft_ultimate_ft(int *********nbr)
{
	*********nbr = 42;
}


/* ************************************************************************** */
/* ************************************************************************** */
