/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strcat.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/10/08 18:03:32 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**
**  - Воспроизведите поведение функции strcat (man strcat).
**
**
**  - Вот как это должно быть обьявлено:
**
**       char	*ft_strcat(char *dest, char *src);
**
**
** ************************************************************************** **
**
**
**  Аргументы:
**
**  dest – указатель на массив в который будет добавлена строка.
**  src – указатель на массив из которого будет скопирована строка.
**
**  Возвращаемое значение:
**
**  Функция возвращает указатель на массив, в который добавлена строка (dest).
**
**  Положительное число – если в первых n символах сравниваемых строк есть отличия и 
** код первого отличающегося символа в строке 's1' больше кода символа на той же позиции 
**  в строке 's2'.
** 
**  Отрицательное число – в первых n символах сравниваемых строк есть отличия и код первого
**  отличающегося символа в строке 's1' меньше кода символа на той же позиции в строке 's2'.
** 
**  Описание:
** 
**  Функция 'strcat' добавляет в строку, на которую указывает аргумент 'dest',
**  строку, на которую указывает аргумент 'src'. Символ конца строки помещается в 
**  конце объединенных строк.
** 
**  Если строки перекрываются, результат объединения будет не определен.
**
** 
** 
** ************************************************************************** **
**
**
** Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую
**
**
** ************************************************************************** */
/* ************************************************************************** */



char	*ft_strcat(char *dest, char *src)
{
	int	i;
	int	dest_size;

	i = 0;
	dest_size = 0;
	while (dest[dest_size])
		dest_size++;
	while (src[i])
	{
		dest[dest_size] = src[i];
		dest_size++;
		i++;
	}
	dest[dest_size] = '\0';
	return (dest);
}



/* ************************************************************************** */
/* ************************************************************************** */

char	*ft_strcat(char *dest, char *src)
{
	char	*ptr;

	ptr = dest;
	while (*dest)
		dest++;
	while (*src)
		*dest++ = *src++;
	*dest = '\0';
	return (ptr);
}


/* ************************************************************************** */
/* ************************************************************************** */

char	*ft_strcat(char *dest, char *src)
{
	int i;
	int lenght;

	i = 0;
	lenght = 0;
	while (dest[i] != '\0')
	{
		lenght++;
		i++;
	}
	i = 0;
	while (src[i] != '\0')
	{
		dest[lenght + i] = src[i];
		i++;
	}
	dest[lenght + i] = '\0';
	return (dest);
}



/* ************************************************************************** */
/* ************************************************************************** */
