/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_convert_base.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */
/*	команда для компиляции и одновременного запуска                           */
/*                                                                            */
/*  gcc -Wall -Werror -Wextra test.c && chmod +x ./a.out && ./a.out	   	      */
/* ************************************************************************** */


#include <unistd.h>					/* Подкоючаем библиотеку содержащую функцию для вывода символов(write) */
#include <stdlib.h>					/* Подкоючаем библиотеку содержащую функцию для выделения памяти(malloc) функцию для подсчета размера переменной(sizeof) */


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */

void	ft_putchar(char c)		/* функция вывода символа */
{
	write(1, &c, 1);
}

/*#############################################################################*/

void	ft_putstr(char *str)   	/* Функция печати строки */
{
	while(*str)
		ft_putchar(*str++);
}

/*#############################################################################*/



char	*ft_concat_params(int argc, char **argv)
{
	int		i;
	int		j;
	int		z;
	char	*string;

	i = 1;
	z = 0;
	while (i < argc)
	{
		j = 0;
		while (argv[i][j])
			j++;
		z += j;
		i++;
	}
	if ((string = (char *)malloc(sizeof(char) * (z + argc))) == ((void *)0))
		return ((void *)0);
	i = 0;
	j = 1;
	z = 0;
	while (j < argc)
	{
		z = 0;
		while (argv[j][z])
		{
			string[i] = argv[j][z];
			z++;
			i++;
		}
		string[i] = '\n';
		i++;
		j++;
	}
	string[i] = '\0';
	return (string);
}



int     main(int argc,char **argv)	/* Основаная функция. Принимаем в аргументах их количество(argc) и массив содержащий строки с аргументами(**argv)  */
{
	if (argc > 2)
		ft_putstr(ft_concat_params(argc, argv));
	return (0);						/* Если дошли до сюда значит основная функция завершается, возвращается ноль и программа завершается */ 
}