/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   last_word.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: exam <evgenkarlson@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by exam              #+#    #+#             */
/*   Created: 2020/02/14 12:33:14 by exam             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */



#include <unistd.h>


void	ft_putstr(char *str)
{
	while (*str)
	{
		write(1, str, 1);
		str++;
	}
}

int		ft_strlen(char *str)
{
	int i = 0;
	while (str[i])
		i++;
	return (i);
}

void	ft_wdmatch(char *s1, char *s2)	/* принимаем адреса двух строк */
{
	int		i;							/* Обьявляем счетчик i для первой строки */
	int		j;							/* Обьявляем счетчик j для второй строки */

	i = 0;								/* Инициализируем счетчик i нулем */
	j = 0;								/* Инициализируем счетчик j нулем */
	while (s2[j] && i < ft_strlen(s1))	/* запускаем цикл работающий до тех пор пока счетчик i 
										 * не дойдет до конца первой строки или пока не дойдем 
										 * до конца второй строки */
	{
		if (s1[i] == s2[j])
			i++;
		j++;
	}
	if (i == ft_strlen(s1))
		ft_putstr(s1);
}

int main(int argc, char **argv)
{
	if (argc == 3)
		ft_wdmatch(argv[1],argv[2]);
	write(1, "\n", 1);
	return (0);
}

