/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: schapuis <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2013/08/14 12:33:14 by schapuis          #+#    #+#             */
/*   Updated: 2013/08/15 10:51:23 by schapuis         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */
/*  	команда для компиляции и одновременного запуска                       */
/*                                                                            */
/*         gcc test.c && chmod +x ./a.out && ./a.out	                      */
/* ************************************************************************** */


#include <unistd.h>


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */

int		ft_putchar(char c)
{
	write(1, &c, 1);

	return (0);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


void	ft_putnbr(int nb)
{
	int	temp;
	int	size;

	size = 1;
	if (nb < 0)
	{
		ft_putchar('-');
		nb = -nb;
	}
	temp = nb;
	while ((temp /= 10) > 0)
		size *= 10;
	temp = nb;
	while (size)
	{
		ft_putchar((char)((temp / size)) + 48);
		temp %= size;
		size /= 10;
	}
}


void ft_putnbrtab(int *tab, int n)
{
	int i = 0;
	while(i < n)
	{
		ft_putnbr(tab[i]);
		ft_putchar('-');
		i++;
	}
}

/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


static int	ft_is_prime(int nb)
{
	int i;

	if (nb < 2)
		return (0);
	i = 2;
	if (nb <= 0)
		return (0);
	while (i <= (nb / 2))
	{
		if (!(nb % i))
			return (0);
		else
			i += 1;
	}
	return (1);
}

int			ft_find_next_prime(int nb)
{
	nb += 1;
	while (!ft_is_prime(nb))
		nb += 1;
	return (nb);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */

void	ft_putstr(char *str)
{
	while (*str != '\0')
	{
		ft_putchar(str[0]);
		str++;
	}
}

void	ft_print_words_tables(char **tab)
{
	int i;

	i = 0;
	while (tab[i])
	{
		ft_putstr(tab[i]);
		ft_putchar('\n');
		i++;
	}
}

char	*ft_strcat(char *dest, char *src)
{
	int i;
	int x;

	i = 0;
	x = 0;
	while (dest[i] != '\0')
		i++;
	while (src[x] != '\0')
	{
		dest[i] = src[x];
		i++;
		x++;
	}
	dest[i] = '\0';
	return (dest);
}


int		main(int argc, char **argv)
{
	char **thxgcc;

	thxgcc = argv;
	if (argc == 1) 
		ft_putchar(48);
	else
		ft_putchar(argc - 1 + 48);
	ft_putchar('\n');
	return (0);
}
