/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   sort_int_tab.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jaleman <jaleman@student.42.us.org>        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2016/11/22 00:59:02 by jaleman           #+#    #+#             */
/*   Updated: 2016/11/22 00:59:06 by jaleman          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** 


Assignment name  : sort_int_tab
Expected files   : sort_int_tab.c
Allowed functions:
--------------------------------------------------------------------------------

Write the following function:
Напишите следующую функцию:


void sort_int_tab(int *tab, unsigned int size);


It must sort (in-place) the 'tab' int array, that contains exactly 'size'
members, in ascending order.
Он должен отсортировать (на месте) массив int «tab», который содержит
точно элементы «size», в порядке возрастания.

Doubles must be preserved.
Двойники должны быть сохранены.

Input is always coherent.
Ввод всегда последовательный.


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


void	sort_int_tab(int *tab, int size)
{
	int i;
	int j;
	int temp;

	i = 0;
	j = 0;
	while (i < size - 1)
	{
		j = 0;
		while (j < size - i - 1)
		{
			if (tab[j] > tab[j + 1])
			{
				temp = tab[j];
				tab[j] = tab[j + 1];
				tab[j + 1] = temp;
			}
			j++;
		}
		i++;
	}
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


void	sort_int_tab(int *tab, int size)
{
	int				temp;
	unsigned int 	i;
	unsigned int 	j;

	i = 0;
	while (i < size - 1)
	{
		j = i;
		while (j < size)
		{
			if (tab[i] > tab[j])
			{
				temp = tab[i];
				tab[i] = tab[j];
				tab[j] = temp;
			}
			j += 1;
		}
		i += 1;
	}
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


