/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_unmatch.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************
 *
 * 
 *	• Напишите функцию «ft_unmatch», которая будет возвращать значение элемента
 *	массива, у которого нет соответствующей пары.
 * 
 *	• Эта функция будет прототипирована следующим образом:
 * 										int		ft_unmatch(int*tab,intlength);
 * 
 *	• Мы гарантируем, что будет только один предмет, у которого не будет пары.
 *
 *	• Два небольших примера, чтобы лучше понять:
 *
 *	• В таблице [1, 1, 2, 3, 4, 3, 4] элемент, который не имеет пары - 2
 *
 *	• В таблице [1, 1, 2, 4, 3, 4, 2, 3, 4] элемент, который не имеет пары - 4
 *
 * 
 * ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int	ft_unmatch(int *tab, int length)
{
	int	i;
	int j;
	int	count;

	i = 0;
	while (i < length)
	{
		j = 0;
		count = 0;
		while (j < length)
		{
			if (tab[j] == tab[i])
				count++;
			j++;
		}
		if (count % 2 == 1)
			return (tab[i]);
		i++;
	}
	return (0);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */