/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_sort_integer_table.c                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: schapuis <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2013/08/15 18:59:31 by schapuis          #+#    #+#             */
/*   Updated: 2013/08/15 19:37:32 by schapuis         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* - Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую */

/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************


Create a function which sorts an array (table) of integers by ascending order.
Создайте функцию, которая сортирует массив (таблицу) целых чисел по возрастанию.

The arguments are a pointer to int and the number of ints in the array.
Аргументами являются указатель на int и число ints в поле массив.


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


void	ft_sort_integer_table(int *tab, int size)
{
	int i;
	int j;
	int temp;

	i = 0;
	j = 0;
	while (i < size - 1)
	{
		j = 0;
		while (j < size - i - 1)
		{
			if (tab[j] > tab[j + 1])
			{
				temp = tab[j];
				tab[j] = tab[j + 1];
				tab[j + 1] = temp;
			}
			j++;
		}
		i++;
	}
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


void	sort_int_tab(int *tab, int size)
{
	int				temp;
	unsigned int 	i;
	unsigned int 	j;

	i = 0;
	while (i < size - 1)
	{
		j = i;
		while (j < size)
		{
			if (tab[i] > tab[j])
			{
				temp = tab[i];
				tab[i] = tab[j];
				tab[j] = temp;
			}
			j += 1;
		}
		i += 1;
	}
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */



