/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/10/08 18:25:39 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/*         команда для компиляции и одновременного запуска программы          */
/*                                                                            */
/*  gcc -Wall -Werror -Wextra test.c && chmod +x ./a.out && ./a.out           */
/* ************************************************************************** */


#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

/* ************************************************************************** */
/* ************************************************************************** */

/* Эта функция считает количество символов в строке(массиве символов) */

int		ft_strlen(char *str)	/* принимаем адрес строки (первого элемента массива) и сохраняем в указателе */
{
	int i;						/* обьявляем счетчик с помощью которого будем перемещатся по массиву символов вперед*/

	i = 0;						/* инициализуем счетчик нулем чтобы отталкиваться от нулевой ячейки массива символов и двигаться по массиву вперед */
	while (str[i] != '\0')		/* Проверяем является ли символ в этой ячейки завершающим нулем '\0'. Если да то завершаем цикл, если нет то запускаем содержимое цикла */
		i++;
	return (i);					/*Если цикл прекращается программа идет к след нструкции которая у нас return (i); */
								/* Она возвращает число которое указывает на количество элементов в массиве */
}


/* ************************************************************************** */
/* ************************************************************************** */


int	main(void)
{	
	char arr[] = "Hello";

	ft_putchar(ft_strlen(arr)  + '0');
	ft_putchar('\n');
	return (0);
}
