/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_ultimate_range.c                                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/10/11 16:54:34 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**
**  - Создайте функцию 'ft_ultimate_range', которая возвращает массив целых чисел.  
**  Этот массив целых чисел 'int' должен содержать все значения, которые находятся 
**  в диапазоне от 'min' до 'max'.
**
**  - Само 'min' значение должно тоже содержаться в массиве чисел требуемого 
**  диапазона - а значение 'max' должно быть исключено.
**
**  - Вот как функция должна быть обьявлена:
**
**		int ft_ultimate_range(int **range, int min, int max);
**
**
**  - Должен быть возвращен размер диапазона (или -1 при ошибке).
**
**  - Если значение 'min' больше или равно значению 'max', должен быть возвращен 
**  нулевой указатель( 'NULL' он же - '((void *)0)' ).
**
**
** ************************************************************************** **
**
**  Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую
**
** ************************************************************************** */
/* ************************************************************************** */


#include <stdlib.h>

int	ft_ultimate_range(int **range, int min, int max)
{
	int	i;
	int	*temp;

	if (min >= max)
		return (-1);
	if ((temp = (int *)malloc(sizeof(int) * (max - min))) == ((void *)0))
		return (-1);
	i = 0;
	while (min < max)
	{
		temp[i] = min;
		min++;
		i++;
	}
	*range = temp;
	return (i);
}

/* ************************************************************************** */
/* ************************************************************************** */

#include <stdlib.h>

int		ft_ultimate_range(int **range, int min, int max)
{
	int i;

	if (min >= max)
		return (-1);
	if ((*range = (int *)malloc(sizeof(int) * (max - min))) == ((void *)0))
		return (-1);
	i = 0;
	while (min < max)
		*range[i++] = min++;
	return (i);
	return (0);
}

/* ************************************************************************** */
/* ************************************************************************** */