/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strlcpy.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************


Reproduce the behavior of the function strlcpy (man strlcpy).
Воспроизведите поведение функции strlcpy (man strlcpy).

Аргументы:

dst — указатель на массив назначения.
src – указатель на массив из которого будет скопирована строка.
size — размер буфера назначения

Функция strlcpy копирует из строки src в массив dst не более чем size - 1 символов
и гарантированно устанавливает в конец строки нулевой символ '\0'.

Для корректной работы функции strlcpy, ей необходимо передавать 
только нультерминальные строки(строки с завершающим нулем '\0').


   ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


unsigned int	ft_strlcpy(char *dest, char *src, unsigned int size)
{
	unsigned int	i;

	i = 0;
	while (src[i] && (i < (size - 1)))
	{
		dest[i] = src[i];
		i++;
	}
	dest[i] = '\0';
	return (i);
}
