#* Нужно ставить в файле что то одно из несколькх вариантов решения *#
#* Каждый из вариантов это скрипт создающий бибилиотеку с функциями *#

#* Сценарий оболочки с именем libft_creator.sh соответствующим образом *#
#* скомпилирует исходные файлы и создаст вашу библиотеку. *#



(gcc -c -Wall -Werror -Wextra *.c) && (ar rc libft.a *.o)




# **************************************************************************** #
# **********************************_ИЛИ_************************************* #
# **************************************************************************** #





#!/bin/bash
# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    libft_creator.sh                                   :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: adespond <adespond@student.42.fr>          +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2015/09/09 09:56:48 by adespond          #+#    #+#              #
#    Updated: 2015/09/09 09:56:48 by adespond         ###   ########.fr        #
#                                                                              #
# **************************************************************************** #
gcc -Wall -Wextra -Werror -c ft_putchar.c ft_swap.c ft_putstr.c ft_strlen.c ft_strcmp.c
ar rc libft.a ft_putchar.o ft_swap.o ft_putstr.o ft_strlen.o ft_strcmp.o
ranlib libft.a
rm *.o







# **************************************************************************** #
# **********************************_ИЛИ_************************************* #
# **************************************************************************** #





#!/bin/bash
gcc -Wall -Werror -Wextra -c *.c
ar rc libft.a *.o






# **************************************************************************** #
# **********************************_ИЛИ_************************************* #
# **************************************************************************** #






#!/bin/sh
# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    libft_creator.sh                                   :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: jpucelle <jpucelle@student.42.fr>          +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2014/07/10 15:15:04 by jpucelle          #+#    #+#              #
#    Updated: 2014/07/10 15:15:55 by jpucelle         ###   ########.fr        #
#                                                                              #
# **************************************************************************** #

gcc -Wall -Wextra -Werror -c ft_putchar.c ft_swap.c ft_putstr.c ft_strlen.c ft_strcmp.c
ar rc libft.a ft_putchar.o ft_swap.o ft_putstr.o ft_strlen.o ft_strcmp.o
rm *.o








# **************************************************************************** #
# **********************************_ИЛИ_************************************* #
# **************************************************************************** #







gcc -c -Wall -Werror -Wextra ft_putchar.c ft_putstr.c ft_strcmp.c ft_strlen.c ft_swap.c && ar rc libft.a ft_putchar.o ft_putstr.o ft_strcmp.o ft_strlen.o ft_swap.o && ranlib libft.a


# **************************************************************************** #
# **********************************_ИЛИ_************************************* #
# **************************************************************************** #
