/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_stock_str.h                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/10/19 13:36:35 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex05/
**  Файлы для сдачи: ft_show_tab.c	
**  Разрешенные функции: write
**
** ************************************************************************** **
**
** 
**  - Создайте функцию, которая отображает содержимое массива, созданного 
**  предыдущей функцией.
**  
**  
**  -  Ваша функция должна быть объявлена ​​следующим образом :
--------------------------------------------------------------------------------

                                    void	ft_show_tab(structs_stock_str *par);

--------------------------------------------------------------------------------
**
**  - Структура будет такой же, как и в предыдущем упражнении, и будет определена
**  в файле "ft_stock_str.h" .
**
**  - Для каждого элемента  массива экземпляров структуры мы будем отображать:
**
**      * строку, за которой следует символ перехода новую строку('\n'); 
**      * размер аргумента, за которой следует символ перехода новую строку('\n'); 
**      * копию строки, за которой следует символ перехода новую строку('\n');.
** 
** 
**  - Мы проверим вашу функцию с помощью нашего ft_strs_to_tab(предыдущее упражнение).
**  Примите соответствующие меры, cделайте так, чтобы это работало!
**
**
** ************************************************************************** **
**
**  Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую
**
** ************************************************************************** */
/* ************************************************************************** */


#ifndef FT_STOCK_STR_H
# define FT_STOCK_STR_H

typedef struct		s_stock_str
{
	int		size;
	char	*str;
	char	*copy;
}					t_stock_str;

void				ft_putchar(char c);
void				ft_putstr(char *str);
void				ft_putnbr(int nb);
void				ft_print_words_tables(char **tab);
void				ft_show_tab(struct s_stock_str *par);


#endif


/* ************************************************************************** */
/* ************************************************************************** */


#ifndef __FT_STOCK_STR_H
# define __FT_STOCK_STR_H

typedef struct		s_stock_str
{
	int		size;
	char	*str;
	char	*copy;
}					t_stock_str;

void				ft_putchar(char c);
void				ft_putstr(char *str);
void				ft_putnbr(int nb);
void				ft_print_words_tables(char **tab);
void				ft_show_tab(struct s_stock_str *par);

#endif


/* ************************************************************************** */
/* ************************************************************************** */
