/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_list_foreach_if.c                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/11/16 17:24:17 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex10/
**  Файлы для сдачи: ft_list_foreach_if.c, ft_list.h
**  Разрешенные функции: Никаких
**
** ************************************************************************** **
 *
 * 
 *	• Создайте функцию «ft_list_foreach_if», которая применяет функцию, задан-
 *	ную в качестве аргумента, к некоторым элементам списка.
 *
 * 
 *	• Применяйте функцию к элементам, только когда 'cmp' с 'data_ref' возвращает '0'.
 *
 * 
 *	• 'f' следует применять в том же порядке, что и в списке.
 * 
 * 
 *	• Вот как эта функция должна быть объявлена :
 *
 *		void	ft_list_foreach_if(t_list *begin_list, void (*f)(void *), void *data_ref, int (*cmp)());
 * 
 * 
 * 
 * 
 *	• Функции, обозначенные f и cmp, будут использоваться следующим образом:
 * 
 * 											(*f)(list_ptr->data);
 *											(*cmp)(list_ptr->data, data_ref);
 * 
 * 
 * 
 *	• К примеру, функция 'cmp' может быть 'ft_strcmp' ...
 * 
 * 
 * 
 * ************************************************************************** */
/* ************************************************************************** */

#include "ft_list.h"

void		ft_list_foreach_if(t_list *begin_list, void (*f)(void *),
							   void *data_ref, int (*cmp)())
{
	while (begin_list)
	{
		if ((*cmp)(begin_list->data, data_ref) == 0)
			(*f)(begin_list->data);
		begin_list = begin_list->next;
	}
}

/* ************************************************************************** */
/* ************************************************************************** */

#include "ft_list.h"

void	ft_list_foreach_if(t_list *begin_list, void (*f)(void *),
		void *data_ref, int (*cmp)())
{
	t_list *list_ptr;

	list_ptr = begin_list;
	while (list_ptr != 0)
	{
		if ((*cmp)(list_ptr->data, data_ref) == 0)
			(*f)(list_ptr->data);
		list_ptr = list_ptr->next;
	}
}

/* ************************************************************************** */
/* ************************************************************************** */

#include "ft_list.h"

void	ft_list_foreach_if(t_list *begin_list, void (*f)(void *), void *data_ref, int (*cmp)())
{
	t_list	*list_ptr;

	list_ptr = begin_list;
	while (list_ptr)
	{
		if ((*cmp)(list_ptr->data, data_ref) == 0)
			(*f)(list_ptr->data);
		list_ptr = list_ptr->next;
	}
}

/* ************************************************************************** */
/* ************************************************************************** */
