/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_list_last.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/02/16 23:41:39 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex03/
**  Файлы для сдачи: ft_list_last.c, ft_list.h
**  Разрешенные функции: Никакие
**
** ************************************************************************** **
**
** 
**	• Создайте функцию "ft_list_last", которая возвращает последний элемент 
**	списка.
**	
** 
**	• Вот как эта функция должна быть объявлена :
**
**											int	ft_list_size(t_list *begin_list);
** 
** ************************************************************************** *
** 
**	••• P.S нас просят создать функцию, которая пройдется до конца связанных
**	между собой экземпляров структур типа t_list и вернет адресс того экзем- 
**	пляра структуры, который окажется последним в этой цепочке связанных 
**	между собой экземпляров структур. 
** 
** 
** ************************************************************************** */
/* ************************************************************************** */


#include "ft_list.h"

t_list	*ft_list_last(t_list *begin_list)
{
	if (begin_list)
	{
		while (begin_list->next)
			begin_list = begin_list->next;
		return (begin_list);
	}
	return ((void *)0);
}

/* ************************************************************************** */
/* ************************************************************************** */

#include "ft_list.h"

t_list	*ft_list_last(t_list *begin_list)
{
	while (begin_list->next)
		begin_list = begin_list->next;
	return (begin_list);
}


/* ************************************************************************** */
/* ************************************************************************** */

#include "ft_list.h"

t_list	*ft_list_last(t_list *begin_list)
{
	t_list	*list;

	list = begin_list;
	if (list)
	{
		while (list->next)
			list = list->next;
	}
	return (list);
}

/* ************************************************************************** */
/* ************************************************************************** */
