/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_is_negative.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* - Create a function that displays ’N’ or ’P’ depending on the integer’s sign 
entered as a parameter. If n is negative, display ’N’. If n is positive or null,
 display ’P’. */

/* - Создайте функцию, которая отображает «N» или «P» в зависимости от целочис-
лнного знака, введенного в качестве параметра. Если n отрицательно, выведите
 «N». Если n является положительным или нулевым, выведите «P». */

/* Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую */

/* ************************************************************************** */

void	ft_putchar(char c);

/* ************************************************************************** */


void	ft_is_negative(int n)
{
	if (n < 0)
		ft_putchar('N');
	else
		ft_putchar('P');
}


/* ************************************************************************** */
