/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/10/07 22:05:08 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/*         команда для компиляции и одновременного запуска                    */
/*                                                                            */
/*  gcc -Wall -Werror -Wextra test.c && chmod +x ./a.out && ./a.out           */
/* ************************************************************************** */


#include <unistd.h>

/* ************************************************************************** */
/* ************************************************************************** */


void	ft_putchar(char c)			/* функция вывода символа */
{
	write(1, &c, 1);
}


void	ft_putnbr(int nb)     		 /* Функция вывода числа */
{
	int		temp;
	int		size;

	size = 1;
	if (nb < 0)
	{
		ft_putchar('-');
		nb = -nb;
	}
	if (nb == -2147483648)
	{	
		ft_putchar('2');
		nb = 147483648;
	}
	temp = nb;
	while ((temp /= 10) > 0)
		size *= 10;
	temp = nb;
	while (size)
	{
		ft_putchar((char)(temp / size) + '0');
		temp %= size;
		size /= 10;
	}
}


/* ************************************************************************** */
/* ************************************************************************** */


/* Эта функция считает количество символов в строке(массиве символов) */

int		ft_strlen(char *str)	/* принимаем адрес строки (первого элемента массива) и сохраняем в указателе */
{
	int i;						/* обьявляем счетчик с помощью которого будем перемещатся по массиву символов вперед*/

	i = 0;						/* инициализуем счетчик нулем чтобы отталкиваться от нулевой ячейки массива символов и двигаться по массиву вперед */
	while (str[i] != '\0')		/* Проверяем является ли символ в этой ячейки завершающим нулем '\0'. Если да то завершаем цикл, если нет то запускаем содержимое цикла */
		i++;
	return (i);					/*Если цикл прекращается программа идет к след нструкции которая у нас return (i); */
								/* Она возвращает число которое указывает на количество элементов в массиве */
}


int 	main(void)
{	
	int		lenght;					
	char	t[] = {"Hello\n"};

	lenght = ft_strlen(t);

	ft_putnbr(lenght);

	return (0);
}

