/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putstr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/10/19 14:47:25 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex05/
**  Файлы для сдачи: ft_putstr.c	
**  Разрешенные функции: write
**
** ************************************************************************** **
**
**
** - Создайте функцию, которая отображает строку символов в стандартном выводе.
**
**
**  - Вот как это должно быть обьявлено:
**
**        void	ft_putstr(char *str);
**
**
** ************************************************************************** **
**
**  Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую
**
** ************************************************************************** */
/* ************************************************************************** */

void	ft_putstr(char *str)
{
	unsigned int	i;

	i = 0;
	while (*(str + i))
		i++;
	write(1, str, i);
}


/*        ИЛИ, тоже самое но, ТАК :        

void	ft_putstr(char *str)
{
	unsigned int	i;

	i = 0;
	while (str[i])
		i++;
	write(1, str, i);
}

*/


/* ************************************************************************** */
/* ************************************************************************** */

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

void	ft_putstr(char *str)		
{
	unsigned int	i;						

	i = 0;						
	while (str[i] != '\0')		
	{
		ft_putchar(str[i]);		
		i++;					
	}
}

/*        ИЛИ, тоже самое но, ТАК :        

void	ft_putstr(char *str)
{
	unsigned int i;

	i = 0;
	while (str[i])
		ft_putchar(str[i++]);
}

*/


/* ************************************************************************** */
/* ************************************************************************** */

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

void	ft_putstr(char *str)
{
	while (*str != '\0')
	{
		ft_putchar(*str);
		str++;
	}
}

/*        ИЛИ, тоже самое но, ТАК :        

void	ft_putstr(char *str)
{
	while (*str)
		ft_putchar(*str++);
}

*/

/* ************************************************************************** */
/* ************************************************************************** */
