/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_atoi.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* - Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую */

/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************


Reproduce the behavior of the function atoi (man atoi).
Воспроизвести поведение функции atoi (man atoi).


 ******************************************************************************


Аргументы:

str – указатель на строку, которую необходимо преобразовать в число.

Возвращаемое значение:

Функция возвращает число - результат преобразование строки, если в начале строки 
содержится число. Если в начале строки стоит символ не являющейся цифрой, то функци возвращает ноль.

Описание:

Функция atoi () преобразует строку, на которую указывает аргумент str, в число типа 
int. Преобразование заканчивается, когда встречается символ не являющейся цифрой или, когда будет преобразована вся строка. Если первый символ строки не цифра, то функция вернет 0 и завершит работу.

Если число в строке превышает максимальный или минимальный размер числа типа int, то 
функция возвращает соответственно максимально или минимально допустимое число для типа 
int. Возвращаемая величина зависит от аппаратной платформы на которой запускается программа.

От функции atol () отличается типом возвращаемого числа и как следствие макимальной 
длинной преобразуемой строки. Для atoi возвращаемое число имеет тип int, а соответственно 
разрядность 16 или 32 бита в зависимости от аппаратной платформы, на которой запускается 
программа. Для atol возвращаемое число имеет тип long int, который всегда 32 разрядный, 
не зависимо от архитектуры процессора.

Так, на пример, в результате преобразования строки "217bg12" будет получено число 217, а 
при преобразовании строки "b237пр" будет получено число 0.


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int	ft_atoi(char *str)
{
	int	i;
	int	negativ;
	int	number;

	i = 0;
	negativ = 0;
	number = 0;
	while ((str[i] == ' ') || (str[i] == '\t') || (str[i] == '\n')
		|| (str[i] == '\v') || (str[i] == '\f') || (str[i] == '\r'))
		i++;
	if (str[i] == '-')
		negativ = 1;
	if ((str[i] == '-') || (str[i] == '+'))
		i++;
	while (str[i] >= '0' && str[i] <= '9')
	{
		number *= 10;
		number += ((int)str[i] - 48);
		i++;
	}
	if (negativ == 1)
		return (-number);
	else
		return (number);
}





/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int			ft_atoi(char *str)
{
	int		v;
	int		n;

	n = 0;
	if (*str == '-')
	{
		str++;
		n = 1;
	}
	v = 0;
	while (*str != '\0')
	{
		if (*str >= '0' && *str <= '9')
			v = (v * 10) + (*str - '0');
		else
			return (0);
		str++;
	}
	return ((v > 0 && n) ? -v : v);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int	ft_atoi(char *str)
{
	int	x;
	int total;
	int is_negative;

	is_negative = 0;
	x = 0;
	total = 0;
	while (str[x] == ' ' || str[x] == '\n' || str[x] == '\r' || str[x] == '\f'
			|| str[x] == '\t' || str[x] == '\v' || str[x] == '+')
		x++;
	if (str[x] == '-')
	{
		is_negative = 1;
		x++;
	}
	while (str[x] >= '0' && str[x] <= '9')
	{
		total *= 10;
		total += ((int)str[x] - 48);
		x++;
	}
	if (is_negative)
		return (-total);
	else
		return (total);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int		ft_atoi(char *str)
{
	int		i;
	int		sign;
	int		nbr;

	i = 0;
	sign = 1;
	nbr = 0;
	if (!str[i])
		return (0);
	while (str[i] == '\t' || str[i] == '\v' || str[i] == '\n' || str[i] == '\r' \
		|| str[i] == '\f' || str[i] == ' ')
		i += 1;
	if (str[i] == '-' || str[i] == '+')
		if (str[i++] == '-')
			sign = -1;
	while (str[i] >= '0' && str[i] <= '9')
		nbr = (nbr * 10) + (str[i++] - 48);
	return (nbr * sign);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */
