/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_is_negative.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/02/16 23:28:31 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex04/
**  Файлы для сдачи: ft_is_negative.c	
**  Разрешенные функции: write
**
** ************************************************************************** **
**
**  - Создайте функцию, которая отображает символы «N» или «P» в зависимости от 
**  целочисленного знака, введенного в качестве параметра. Если n отрицательно,
**  выведите символ «N». Если 'n' является положительным или нулевым, выведите 
**  символ «P».
**
**	- Функция должна быть обьялена следующим образом:
**
**                      void	ft_is_negative(int n);
**
** ************************************************************************** **
**
**  Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую
**
** ************************************************************************** */
/* ************************************************************************** */


#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

void	ft_is_negative(int n)
{
	if (n < 0)
		ft_putchar('N');
	else
		ft_putchar('P');
}


/* ************************************************************************** */
/* ************************************************************************** */
