/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   match.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jaleman <jaleman@student.42.us.org>        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2016/08/21 14:59:29 by jaleman           #+#    #+#             */
/*   Updated: 2016/08/21 14:59:31 by jaleman          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************


The purpose of this function is to find out whether two strings match.
• s1 and s2 are considered to match when s1 and s2 are identical.
• If s2 contains a star (’*’), we can replace this star by any characters string (even empty) to make s1 and s2 identical.
• s2 may hold as many stars as you’d like.
• For example, "main.c" and "*.c" match because it is possible to replace ’*’ by the string "main" to render those two strings identical.

• It must return 1 if s1 and s2 match, or 0 if they don’t.


Цель этой функции - выяснить, совпадают ли две строки.
• s1 и s2 считаются совпадающими, когда s1 и s2 идентичны.
• Если s2 содержит звезду (’*’), мы можем заменить эту звезду на любую строку символов (даже пустую), чтобы сделать s1 и s2 идентичными.
• s2 может содержать столько звезд, сколько вы хотите.
• Например, «main.c» и «* .c» совпадают, поскольку можно заменить «*» на строку «main», чтобы сделать эти две строки идентичными.

• Должно возвращаться 1, если s1 и s2 совпадают, или 0, если они не совпадают.


   ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */

int		match(char *s1, char *s2)
{
	if (*s1 != '\0' && *s2 == '*')
		return (match(s1, s2 + 1) || match(s1 + 1, s2));
	if (*s1 == '\0' && *s2 == '\0')
		return (1);
	if (*s1 == *s2)
		return (match(s1 + 1, s2 + 1));
	if (*s1 == '\0' && *s2 == '*')
		return (match(s1, s2 + 1));
	return (0);
}


/* ************************************************************************** */
/* ******************************_OR_THAT_*********************************** */
/* ************************************************************************** */


int		match(char *s1, char *s2)
{
	if (*s1 != '\0' && *s2 == '*')
		return (match(s1 + 1, s2) || match(s1, s2 + 1));
	if (*s1 == '\0' && *s2 == '*')
		return (match(s1, s2 + 1));
	if (*s1 == *s2 && *s1 != '\0' && *s2 != '\0')
		return (match(s1 + 1, s2 + 1));
	if (*s1 == *s2 && *s1 == '\0' && *s2 == '\0')
		return (1);
	return (0);
}

/* ************************************************************************** */
/* ******************************_OR_THAT_*********************************** */
/* ************************************************************************** */


int		match(char *s1, char *s2)
{
	if (*s1 == '\0' && *s2 == '\0')
		return (1);
	else if (*s1 == '\0' || *s2 == '\0')
		return (0);
	else if (*s1 == *s2)
		return (match(s1 + 1, s2 + 1));
	else if (*s2 == '*')
		return (match(s1 + 1, s2) || match(s1 + 1, s2 + 1));
	else
		return (0);
}


/* ************************************************************************** */
/* ******************************_OR_THAT_*********************************** */
/* ************************************************************************** */



int		match(char *s1, char *s2)
{
	if (s1[0] == '\0' && s2[0] == '\0')
		return (1);
	else if (s1[0] == s2[0] && s1[0] != '*' && s2[0] != '*')
		return (match(&s1[1], &s2[1]));
	else if (s1[0] == '*' && s2[0] == '*')
		return (match(&s1[1], &s2[0]));
	else if (s1[0] == '\0' && s2[0] == '*')
		return (match(&s1[0], &s2[1]));
	else if (s2[0] == '*' && s1[0] != '\0')
		return (match(&s1[0], &s2[1]) || match(&s1[1], &s2[0]));
	return (0);
}




/* ************************************************************************** */
/* ******************************_OR_THAT_*********************************** */
/* ************************************************************************** */



unsigned int	ft_strlen(char *str)
{
	int len;

	len = 0;
	while (*(str + len) != '\0')
	{
		len++;
	}
	return (len);
}

unsigned int	star_count(char *str)
{
	int n;

	n = 0;
	while (*str)
		if (*str++ == '*')
			n++;
	return (n);
}

int				recur(char *s1, char *s2, unsigned int star_len)
{
	unsigned int i;

	while (1)
	{
		if (*s2 == '*')
		{
			i = 0;
			while (i++ <= star_len)
				if (recur(s1 + i - 1, s2 + 1, star_len - i + 1))
					return (1);
			return (0);
		}
		if (!*s1)
		{
			if (!*s2)
				return (1);
			return (0);
		}
		if (!*s2)
			return (0);
		if (*s1++ != *s2++)
			return (0);
	}
}

int				match(char *s1, char *s2)
{
	return (recur(s1, s2, ft_strlen(s1) - ft_strlen(s2) + star_count(s2)));
}

