/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strlen.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <marvin@42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2013/08/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2013/08/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */
/*	команда для компиляции и одновременного запуска                           */
/*                                                                            */
/*  gcc -Wall -Werror -Wextra test.c && chmod +x ./a.out && ./a.out	   	      */
/* ************************************************************************** */



#include <unistd.h>

/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int		ft_putchar(char c)			/* Функция вывода символа */
{
	write(1, &c, 1);

	return (0);
}


void	ft_putnbr(int nb)     		 /* Функция вывода числа */
{
	int		temp;
	int		size;

	size = 1;
	if (nb < 0)
	{
		ft_putchar('-');
		nb = -nb;
	}
	temp = nb;
	while ((temp /= 10) > 0)
		size *= 10;
	temp = nb;
	while (size)
	{
		ft_putchar((char)(temp / size) + '0');
		temp %= size;
		size /= 10;
	}
}


/* #######################################################################*/

/* Эта функция подсчитывает и возвращает количество символов в строке. */


int		ft_strlen(char *str)
{
	int n;						/* обьявляем пременную int. она будет использованная как счетчик для цикла */

	n = 0;						/* инициализируем переменную нулем так ка именно через нее мы будем обрашатся к нулевому элементу массива, потом первому элементу и т.д */
	while (str[n] != '\0')		/* с помощью переменной обращаемся к нулевому элементу */ /*если он не равен завершающему символоу массива '\0' 
								то увеличиваем число на один и проверяется сл. элемент массива */ /* если  он равен завершающему символоу массива '\0' то цикл прекращается 
								и программа идет к след нструкции которая у нас return (i);    */
	{
		n++;
	}
	return (n);					/* возвращает число которое указывает на количество элементов в массиве */
}


int 	main(void)
{	
	int lenght;

	char t[] = {"Hello\n"};

	lenght = ft_strlen(t);

	ft_putstr(lenght);

	return 0;
}

