/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_print_comb.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/02/16 23:28:47 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex05/
**  Файлы для сдачи: ft_print_comb.c	
**  Разрешенные функции: write
**
** ************************************************************************** **
**
**  - Создайте функцию, которая отображает все различные комбинации трех разных
**  цифр в порядке возрастания, перечисленных в порядке возрастания  - да, 
**  повторение является добровольным.
**
**
**  - Вот предполагаемый результат:
--------------------------------------------------------------------------------
 
    $>./a.out | cat -e
    012, 013, 014, 015, 016, 017, 018, 019, 023, ...,  689, 789$>

--------------------------------------------------------------------------------
*
**
**  - 987 не должно быть, потому что 789 уже есть.
**
**  - 999 тоже, потому что цифра 9 присутствует более одного раза.
**
**	- Функция должна быть обьялена следующим образом:
**
**                      void	ft_print_comb(void);
**
** ************************************************************************** **
**
**  Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую
**
** ************************************************************************** */
/* ************************************************************************** */


#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

void	ft_commas(void)
{
	ft_putchar(',');
	ft_putchar(' ');
}

void	ft_print_comb(void)
{
	int num[3];

	num[0] = '0';
	while (num[0] <= '9')
	{
		num[1] = '0';
		while (num[1] <= '9')
		{
			num[2] = '0';
			while (num[2] <= '9')
			{
				if (num[0] < num[1] && num[1] < num[2])
				{
					ft_putchar(num[0]);
					ft_putchar(num[1]);
					ft_putchar(num[2]);
					if(!(num[0] == '7' && num[1] == '8' && num[2] == '9'))
						ft_commas();
				}
				num[2]++;
			}
			num[1]++;
		}
		num[0]++;
	}
}


/* ************************************************************************** */
/* ************************************************************************** */

#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

void	ad_print_numbers(char c, char d, char u)
{
	ft_putchar(c);
	ft_putchar(d);
	ft_putchar(u);
}

void	ad_print_space(void)
{
	ft_putchar(',');
	ft_putchar(' ');
}

void	ft_print_comb(void)
{
	char c;
	char d;
	char u;

	c = '0';
	while (c <= '9')
	{
		d = c + 1;
		while (d <= '9')
		{
			u = d + 1;
			while (u <= '9')
			{
				ad_print_numbers(c, d, u);
				if (!(c == '7' && d == '8' && u == '9'))
				{
					ad_print_space();
				}
				u++;
			}
			d++;
		}
		c++;
	}
}




/* ************************************************************************** */
/* ************************************************************************** */

#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

void	ft_print_comb(void)
{
	char	nbr1;
	char	nbr2;
	char	nbr3;

	nbr1 = '0' - 1;
	while (++nbr1 <= '9')
	{
		nbr2 = nbr1;
		while (++nbr2 <= '9')
		{
			nbr3 = nbr2;
			while (++nbr3 <= '9')
			{
				if (nbr1 != '0' || nbr2 != '1' || nbr3 != '2')
					ft_putchar(',');
				if (nbr1 != '0' || nbr2 != '1' || nbr3 != '2')
					ft_putchar(' ');
				ft_putchar(nbr1);
				ft_putchar(nbr2);
				ft_putchar(nbr3);
			}
		}
	}
}


/* ************************************************************************** */
/* ************************************************************************** */

#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

void	ft_print_comb(void)
{
	int	numbers[3] = {'0', '0', '0'};

	while (numbers[0] <= '9')
	{
		if ((numbers[0] < numbers[1]) && (numbers[1] < numbers[2]))
		{
			ft_putchar(numbers[0]);
			ft_putchar(numbers[1]);
			ft_putchar(numbers[2]);
			if (numbers[0] != '7')
				ft_putchar(',');
			if (numbers[0] != '7')
				ft_putchar(' ');
		}
		if (numbers[2]++ >= '9')
		{
			numbers[2] = '0';
			numbers[1]++;
		}
		if (numbers[1] == ':')
		{
			numbers[1] = '0';
			numbers[0]++;
		}
	}
}


/* ************************************************************************** */
/* ************************************************************************** */