/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_stock_par.h                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************   

	Разрешенные функции: ft_split_whitespaces, ft_show_tab, malloc

   **************************************************************************   

	• Создать функцию, которая хранит аргументы программы в структуре массива 
	и возвращает адрес первого блока этого массива.

	• Все элементы массива должны быть обработаны, включая av [0].

	• Вот как это должно быть прототипировано:

					   struct s_stock_par *ft_param_to_tab(int ac, char **av);

	• Массив структуры должен быть размещен в своем элементе str и его последний 
	блок должен содержать 0, чтобы указать на конец массива.

	• Структура определяется в файле ft_stock_par.h, как тут:

													typedef struct	s_stock_par
													{
														int size_param;
														char *str;
														char *copy;
														char **tab;
													}				t_stock_par;

	◦ size_param - длина аргумента;
	◦ str - адрес аргумента;
	◦ copy является копией аргумента;
	◦ tab - массив, возвращаемый ft_split_whitespaces.


	• Мы протестируем вашу функцию с помощью наших ft_split_whitespaces и нашего 
	ft_show_tab (следующее упражнение). Примите соответствующие меры, чтобы это работало!


   ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


#ifndef FT_STOCK_PAR_H
# define FT_STOCK_PAR_H
# include <stdlib.h>

typedef	struct		s_stock_par
{
	int		size_param;
	char	*str;
	char	*copy;
	char	**tab;
}					t_stock_par;

void				ft_show_tab(t_stock_par *par);
char				**ft_split_whitespaces(char *str);
char				*ft_strdup(char *src);
struct s_stock_par	*ft_param_to_tab(int ac, char **av);


#endif


/* ************************************************************************** */
/* ***********************************_ИЛИ_********************************** */
/* ************************************************************************** */


#ifndef __FT_STOCK_PAR_H
# define __FT_STOCK_PAR_H
# include <stdlib.h>

typedef struct		s_stock_par
{
	int		size_param;
	char	*str;
	char	*copy;
	char	**tab;
}					t_stock_par;

void				ft_show_tab(t_stock_par *par);
char				**ft_split_whitespaces(char *str);
int					ft_strlen(char *str);
struct s_stock_par	*ft_param_to_tab(int ac, char **av);
#endif


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */
