/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_print_reverse_alphabet.c                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: schapuis <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2013/08/14 13:56:31 by schapuis          #+#    #+#             */
/*   Updated: 2013/08/16 10:26:22 by schapuis         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*	Create a function that displays the alphabet in lowercase, on a single line, by descending order, starting from the letter ’z’.	*/

/*	Создайте функцию, которая отображает алфавит в нижнем регистре в одну строку в порядке убывания, начиная с буквы «z».	*/

/* Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую */

/* ************************************************************************** */

int		ft_putchar(char c);

/* ************************************************************************** */

void	ft_print_reverse_alphabet(void)
{
	char	letter;

	letter = 'z';
	while (letter >= 'a')
	{
		ft_putchar(letter);
		letter--;
	}
}


/* ************************************************************************** */
/* ********************************__OR__************************************ */
/* ************************************************************************** */


void	ft_print_reverse_alphabet(void)
{
	int		i;
	char	c;

	i = 122;
	while (i >= 97)
	{
		c = i;
		ft_putchar(c);
		i--;
	}
}

/* ************************************************************************** */
