/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/01/16 04:19:17 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/*         команда для компиляции и одновременного запуска                    */
/*                                                                            */
/*  gcc -Wall -Werror -Wextra test.c && chmod +x ./a.out && ./a.out           */
/* ************************************************************************** */


#include <unistd.h>

/* ************************************************************************** */
/* ************************************************************************** */

void	ft_putchar(char c)			/* функция вывода символа */
{
	write(1, &c, 1);
}

/* ************************************************************************** */
/* ************************************************************************** */

void	ft_putstr(char *s)			/* функция вывода строки */
{
	while (*s)
		write(1, s++, 1);
}

/* ************************************************************************** */
/* ************************************************************************** */

void	ft_putnbr(int nb)
{
	int	temp;
	int	size;

	size = 1;
	if (nb < 0)
	{
		ft_putchar('-');
		nb = -nb;
	}
	if (nb == -2147483648)
	{	
		ft_putchar('2');
		nb = 147483648;
	}
	temp = nb;
	while ((temp /= 10) > 0)
		size *= 10;
	temp = nb;
	while (size)
	{
		ft_putchar((char)((temp / size)) + 48);
		temp %= size;
		size /= 10;
	}
}

/* ************************************************************************** */
/* ************************************************************************** */


int		ft_is_prime(int nb)			/* функция проверки числа на простоту */
{
	int i;

	if (nb < 2)
		return (0);
	i = 2;
	while (i <= (nb / i))
	{
		if ((nb % i) == 0) 
			return (0);
		i++;
	}
	return (1);
}

/*
**
** https://zen.yandex.ru/media/mathematic/prosteishee-i-legendarnoe-resheto-eratosfena-ego-prohodiat-v-5-klasse-5f958e9a4dcc5c613ce51830
**
** https://stackoverflow.com/questions/62150130/algorithm-of-checking-if-the-number-is-prime
**
** P.S. Число, которое не является простым, будет делиться хотя бы на одно 
** простое число.  Следовательно, способ ускорить алгоритм (за счет памяти)
** состоял бы в том, чтобы сохранить список простых чисел, с которыми вы уже 
** столкнулись, и только проверить, делит ли какое-либо из них число, которое 
** вы в настоящее время проверяете, на каждой итерации.
*/

/* ************************************************************************** */
/* ************************************************************************** */

int 	main(void)
{

	if (ft_is_prime(4))					/* проверяем простое ли число */
		ft_putstr("число простое\n");	/* если число простое то выведем один текст */
	else
		ft_putstr("число составное\n");	/* если число не простое то выведем другой текст */
	return (0);
}