/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_print_reverse_alphabet.c                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: schapuis <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2013/08/14 13:56:31 by schapuis          #+#    #+#             */
/*   Updated: 2013/08/16 10:26:22 by schapuis         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*	Create a function that displays all digits, on a single line, by ascending order.	*/

/*	Создать функцию, которая отображает все цифры в одной строке в порядке возрастания.	*/

/* Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую */

/* ************************************************************************** */

void	ft_putchar(char c);

/* ************************************************************************** */

void	ft_print_numbers(void)
{
	char	number;

	number = '0';
	while (number <= '9')
	{
		ft_putchar(number);
		number++;
	}
}


/* ************************************************************************** */
