/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_ultimator.h                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** 


	• Напишите функцию ft_destroy (), которая уничтожит (вызвав функцию free) 
	фабрику, переданную в параметре.

	• Эта функция будет прототипирована следующим образом:
										void	ft_destroy(char	***factory);

	• Вам нужно будет включить файл headerft_ultimator.h

	• Фабрика разумно отграничена от NULL.


   ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


#ifndef __FT_ULTIMATOR_H__
# define __FT_ULTIMATOR_H__
/*
**
** Avec Windows VISTA, on etait au bord du precipice.
** Avec Windows 8, on a fait un grand pas en avant
**
** Le Client:'J'ai un PC avec Windows 8'
** Le Technicien:'Oui...'
** Le Client:'Et puis mon PC ne marche plus'
** Le Technicien:'Oui, vous me l'avez deja dit'...
**
*/

#endif