/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_range.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/10/11 16:54:45 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**
**  - Создайте функцию 'ft_range', которая возвращает массив целых чисел. Этот массив 
**  целых чисел 'int' должен содержать все значения, которые находятся в диапазоне
**  от 'min' до 'max'.
**
**  - Само 'min' значение должно тоже содержаться в массиве чисел требуемого 
**  диапазона - а значение 'max' должно быть исключено.
**
**  - Вот как функция должна быть обьявлена:
**
**		int	*ft_range(int min, int max);
**
**
**  - Если значение 'min' больше или равно значению 'max', должен быть возвращен 
**  нулевой указатель( 'NULL' он же - '((void *)0)' ).
**
**
** ************************************************************************** **
**
**  Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую
**
** ************************************************************************** */
/* ************************************************************************** */


#include <stdlib.h>

int	*ft_range(int min, int max)
{
	int	*tab;
	int	i;

	i = 0;
	if (min >= max)
		return ((void *)0);
	if ((tab = (int *)malloc(sizeof(int) * (max - min))) == ((void *)0))
		return ((void *)0);
	while (min < max)
	{
		tab[i] = min;
		min++;
		i++;
	}
	return (tab);
}

/* ************************************************************************** */
/* ************************************************************************** */

int		*ft_range(int min, int max)
{
	int *t;
	int m;

	if (min >= max)
		return (NULL);
	m = max - min - 1;
	if ((t = (int *)malloc(sizeof(int) * m)) == NULL)
		return (NULL);
	m++;
	while (m > min)
		t[m--] = m;
	return (t);
}

/* ************************************************************************** */
/* ************************************************************************** */

int	*ft_range(int min, int max)
{
	int	*range;
	int	i;

	if (min >= max)
	{
		range = NULL;
		return (range);
	}
	i = min;
	range = (int*)malloc(sizeof(int) * (max - min));
	while (min < max)
	{
		range[min - i] = min;
		min++;
	}
	return (range);
}

/* ************************************************************************** */
/* ************************************************************************** */

int		*ft_range(int min, int max)
{
	int	*ret;
	int count;
	int i;

	if (min >= max)
	{
		ret = 0;
		return (ret);
	}
	else
	{
		count = max - min;
		ret = (int*)malloc(sizeof(*ret) * count);
		i = 0;
		while (min < max)
		{
			ret[i] = min;
			min++;
			i++;
		}
	}
	return (ret);
}

/* ************************************************************************** */
/* ************************************************************************** */

int		*ft_range(int min, int max)
{
	int i;
	int *arr;

	i = 0;
	if (max < min || !(arr = (int *)malloc(sizeof(int) * (max - min) + 1)))
		return (0);
	while (min <= max)
		arr[i++] = min++;
	return (arr);
}

/* ************************************************************************** */
/* ************************************************************************** */