/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/05/12 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/09/28 19:22:06 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/*         команда для компиляции и одновременного запуска                    */
/*                                                                            */
/*  gcc -Wall -Werror -Wextra test.c && chmod +x ./a.out && ./a.out           */
/* ************************************************************************** */


#include <unistd.h>

void	ft_putchar(char c)		/* Функция печати символа */
{
	write(1, &c, 1);
}

void	ft_putstr(char *str)	/* Функция печати строки */
{
	while (*str)
		ft_putchar(*str++);
}

void	ft_generic(void)
{
	ft_putstr("Tu tu tu tu ; Tu tu tu tu");
	ft_putchar('\n');
}


int		main(void)				/* Основаная функция */
{
	ft_generic();
	return (0);
}