/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_swap.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jaleman <jaleman@student.42.us.org>        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2016/09/01 14:38:25 by jaleman           #+#    #+#             */
/*   Updated: 2016/09/01 14:41:20 by jaleman          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************


Assignment name  : ft_swap
Expected files   : ft_swap.c
Allowed functions: 
--------------------------------------------------------------------------------

Write a function that swaps the contents of two integers the adresses of which
are passed as parameters.
Напишите функцию, которая меняет содержимое двух целых чисел, адреса которых 
передаются в качестве параметров.

Your function must be declared as follows:
Ваша функция должна быть объявлена ​​следующим образом:

void	ft_swap(int *a, int *b);


   ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


void	ft_swap(int *a, int *b)
{
	int		tmp;

	tmp = *a;
	*a = *b;
	*b = tmp;
}
