/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_takes_place.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** 

	Разрешенные функции : write, printf

   **************************************************************************


	• Напишите функцию ft_takes_place, которая будет отображать время на 
	стандартном выводе таким образом, как:
					THE FOLLOWING TAKES PLACE BETWEEN X.00 A.M. AND Y.00 A.M.
	после чего следует разрыв строки. Например:
					THE FOLLOWING TAKES PLACE BETWEEN 10.00 A.M. AND 11.00 A.M.

	• Эта функция будет прототипирована следующим образом:
												void	ft_takes_place(inthour);

	• Параметр будет недействительным в 24-часовом формате. Вывод будет в формате AM / PM.

	• Обратите внимание на полдень и полночь!


   ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */

#include <stdio.h>

void	ft_takes_place(int hour)
{
	if ((hour >= 0) && (hour <= 24))
	{
		int h1;
		int h2;
		char	am_pm_1;
		char	am_pm_2;

		h1 = ((hour == 12) ? hour : (hour % 12));
		h2 = (((hour + 1) == 12) ? (hour + 1) : ((hour + 1) % 12));
		am_pm_1 = (((hour < 12) || (hour > 23)) ? 'A' : 'P');
		am_pm_2 = ((((hour + 1) < 12) || ((hour + 1) > 23)) ? 'A' : 'P');
		printf("THE FOLLOWING TAKES PLACE BETWEEN %d.00 %c.M. AND %d.00 %c.M.\n", h1, am_pm_1, h2, am_pm_2);
	}
	else
		printf("Number is wrong");
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


#include <stdio.h>

void	ft_takes_place(int hour)
{
	int	h;

	h = hour;
	if (hour > 12)
		h = hour % 12;
	if (hour == 0)
		h = 12;

	printf("THE FOLLOWING TAKES PLACE BETWEEN ");
	if (hour < 11)
		printf("%d.00 A.M. AND %d.00 A.M.\n", h, (h + 1) % 12);
	else if (hour == 11)
		printf("11.00 A.M. AND 12.00 P.M.\n");
	else if (hour == 23)
		printf("11.00 P.M. AND 0.00 A.M.\n");
	else if (hour == 24)
		printf("12.00 A.M. AND 1.00 A.M.\n");
	else
		printf("%d.00 P.M. AND %d.00 P.M.\n", h, (h + 1) % 12);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */

#include <stdio.h>

void	ft_takes_place(int hour)
{
	int h1;
	int h2;
	int ampm1;
	int ampm2;

	h1 = hour;
	h2 = (((hour + 1) == 24) ? 0 : (hour + 1));
	ampm1 = 0;
	ampm2 = 0;
	if (h1 >= 12)
	{
		h1 -= 12;
		ampm1 = 1;
	}
	if (h2 >= 12)
	{
		h2 -= 12;
		ampm2 = 1;
	}
	h1 = (h1 == 0 ? 12 : h1);
	h2 = (h2 == 0 ? 12 : h2);
	printf("THE FOLLOWING TAKES PLACE BETWEEN %d.00 %s. AND %d.00 %s.\n", h1,
			(ampm1 == 0 ? "A.M" : "P.M"), h2, (ampm2 == 0 ? "A.M" : "P.M"));
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */

#include <stdio.h>

void	ft_takes_place(int hour)
{
	char	ampm;

	if (hour == 24)
		hour = 0;
	ampm = (hour > 11) ? 'P' : 'A';
	printf("%s", "THE FOLLOWING TAKES PLACE BETWEEN ");
	if (hour > 12)
		printf("%d", hour - 12);
	else
		printf("%d", (hour == 0) ? hour + 12 : hour);
	printf(".00 %cM AND ", ampm);
	if (hour == 11)
		ampm = 'P';
	else if (hour == 23)
		ampm = 'A';
	if (ampm == 'P')
		printf("%d", hour - 11);
	else
		printf("%d", hour + 1);
	printf(".00 %cM\n", ampm);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */

#include <stdio.h>

void	ft_takes_place(int hour)
{
	if (hour >= 0 && hour <= 24)
	{
		printf("THE FOLLOWING TAKES PLACE BETWEEN ");
		if (hour == 0 || hour == 24)
			printf("12.00 A.M AND 1.00 A.M.\n");
		if (hour == 11)
			printf("11.00 A.M. AND 12.00 P.M.\n");
		else if (hour == 12)
			printf("12.00 P.M. AND 1.00 P.M.\n");
		else if (hour == 23)
			printf("11.00 P.M. AND 12.00 A.M.\n");
		else if (hour >= 1 && hour <= 10)
			printf("%d.00 A.M. AND %d.00 A.M.\n", (hour), (hour + 1));
		else if (hour >= 13 && hour <= 22)
			printf("%d.00 P.M. AND %d.00 P.M.\n", (hour - 12), (hour - 11));
	}
}




/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */
