/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_sqrt.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jpucelle <jpucelle@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2014/07/09 16:16:43 by jpucelle          #+#    #+#             */
/*   Updated: 2014/07/09 16:34:11 by jpucelle         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* - Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую */

/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************


Create a function that returns the square root of a number (if it exists),
or 0 if the square root is an irrational number
Создайте функцию, которая возвращает квадратный корень из числа (если оно
существует), или 0, если квадратный корень является иррациональным числом

Your function must return its result in less than two seconds.
Ваша функция должна вернуть свой результат менее чем за две секунды.


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int		ft_sqrt(int nb)
{
	int	i;

	i = 0;
	while (i * i < nb)
		i++;
	if (i * i == nb)
		return (i);
	else
		return (0);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */

int		ft_sqrt(int nb)
{
	int		sqr;

	sqr = 1;
	while ((sqr * sqr) < nb)
		sqr += 1;
	if ((sqr * sqr) == nb)
		return (sqr);
	return (0);
}



/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */