/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   btree_apply_by_level.c                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/11/17 17:55:20 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex06/
**  Файлы для сдачи: btree_level_count.c, ft_btree.h	
**  Разрешенные функции: malloc, free
**
** ************************************************************************** **
**
** 
**	• Создайте функцию btree_apply_by_level, которая применяет функцию, переданную
**  в качестве аргумента, к каждому узлу дерева. Дерево должно быть просмотрено 
**  уровень за уровнем. Вызываемая функция будет принимать три аргумента :
**
**		◦ Первый аргумент типа 'void *' будет соответствовать элементу узла ;
** 
**		◦ Второй аргумент типа 'int' соответствует уровню, на котором мы 
**      находим: 0 для корня, 1 для детей, 2 для внуков и т.д .;
**
**		◦ Третий аргумент типа 'int' имеет значение 1, если он является первым
**      узлом уровня, или 0 в противном случае.
** 
** 
**	• Вот как эта функция должна быть объявлена:
**
**  void	btree_apply_by_level(t_btree *root, void (*applyf)(void *item, int current_level, int is_first_elem));
** 
** 
** ************************************************************************** */
/* ************************************************************************** */

#include "ft_btree.h"
#include <stdlib.h>

int		btree_level_count(t_btree *root)
{
	if (root)
		return (1 + MAX(btree_level_count(root->left), \
				btree_level_count(root->right)));
	return (0);
}
