/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_print_alphabet.c                                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*	Create a function that displays the alphabet in lowercase, on a single line, by ascending order, starting from the letter ’a’.	*/

/*	Создайте функцию, которая отображает алфавит в нижнем регистре, в одной строке, в порядке возрастания, начиная с буквы «а». 	*/

/* Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую */

void	ft_putchar(char c);

/* ************************************************************************** */

void	ft_print_alphabet(void)
{
	char	letter;

	letter = 'a';
	while (letter <= 'z')
	{
		ft_putchar(letter);
		letter++;
	}
}


/* ************************************************************************** */
/* ********************************__OR__************************************ */
/* ************************************************************************** */


void	ft_print_alphabet(void)
{
	int		i;
	char	c;

	i = 97;
	while (i <= 122)
	{
		c = i;
		ft_putchar(c);
		i++;
	}
}
/* ************************************************************************** */
