/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_count_if.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/02/16 23:40:03 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */ 
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex03/
**  Файлы для сдачи: ft_count_if.c	
**  Разрешенные функции: Никакие
**
** ************************************************************************** **
 *
 *  • Эта функция должна быть применена в соответствии с порядком массива.
 *
 * 
 *	• Создайте функцию "ft_count_if", которая будет возвращать количество 
 *	элементов массива, не возвращающих 0, при передаче этих элементов в функцию "f".
 *
 *  • Эта функция должна быть применена в соответствии с порядком массива.
 * 
 * 
 *	• Вот как эта функция должна быть объявлена :
 -------------------------------------------------------------------------------
 |				int		ft_count_if(char **tab, int(*f)(char*))                |
 -------------------------------------------------------------------------------
 *
 * 
 * 
 * ************************************************************************** */ 
/* ************************************************************************** */

int		ft_count_if(char **tab, int (*f)(char*))
{
	int count;
	int i;

	count = 0;
	i = 0;
	while (tab[i])
	{
		if (f(tab[i]) != 0)
			count++;
		i++;
	}
	return (count);
}


/* ************************************************************************** */
/* ************************************************************************** */


int	ft_count_if(char **tab, int(*f)(char*))
{
	int	i;
	int	nb;

	i = 0;
	nb = 0;
	while (tab[i] != '\0')
	{
		if (f(tab[i]) != 0)
			nb++;
		i++;
	}
	return (nb);
}


/* ************************************************************************** */
/* ************************************************************************** */