/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/05/12 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/11/08 00:09:55 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/*         команда для компиляции и одновременного запуска                    */
/*                                                                            */
/*  gcc -Wall -Werror -Wextra test.c && chmod +x ./a.out && ./a.out           */
/* ************************************************************************** */

#include <unistd.h>				/* Подключаем библиотеку содержащую функцию "write" */

/* ************************************************************************** */

void		ft_putchar(char c)	/* Функция печати символа */
{
	write(1, &c, 1);
}

/* ************************************************************************** */

void		ft_putnbr(int nb)	/* Функция печати числа */
{
	int	temp;
	int	size;

	size = 1;
	if (nb < 0)
	{
		ft_putchar('-');
		nb = -nb;
	}
	if (nb == -2147483648)
	{	
		ft_putchar('2');
		nb = 147483648;
	}
	temp = nb;
	while ((temp /= 10) > 0)
		size *= 10;
	temp = nb;
	while (size)
	{
		ft_putchar((char)((temp / size)) + 48);
		temp %= size;
		size /= 10;
	}
}

/* ************************************************************************** */

int		ft_find_separator(char *str) /* Функция ищет в строке непечатаемые символы или символы пробела */
{
	int i;
	int boolean;

	i = 0;
	boolean = 0;
	while (str[i])
	{
		if (str[i] < '!')
			boolean = 1;
		i++;
	}
	return (boolean);
}

/* ************************************************************************** */

int		ft_count_if(char **tab, int (*f)(char*))
{
	int i;						/* Обьявляем переменную для счетчика */
	int count;					/* Обьявляем переменную для хранения количества */

	i = 0;						/* Инициализируем счечик нулем */
	count = 0;					/* Инициализируем нулем переменную для хранения количества */
	while (tab[i])				/* Запускаем цикл кооторый пройдет по каждой строке массива строк */
	{
		if (f(tab[i]) != 0)		/* Отправляем адресс текущей строки в функцию. Если результат работы функции над текущей строкой равен 1 */
			count++;			/* То прибавляем '1' к переменной храненящей количество строк c нужным результатом */
		i++;					/* Увеличиваем счетчик для прехода к след строке */
	}
	return (count);				/* Завершаем функцию и возвращаем значение переменной 'count' */
}


int 		main(void)
{
	/* Создадим несколько строк для теста и сохраним их адреса в массиве указателей */
	char *arr[4] = {"HolaHolaLalala_ksijrnfejrn", \
					"jyawgvefiueomwe arawefwe fwef wefweef", \
					"sfds jkljsda kjl sfd sdf sdfsdfd sdfsdfsdf"};

	/* Отправим адресс массива указателей с адресами наших строк(массивов символов) в функцию и отправим в функцию адрес функции 'ft_find_separator' */
	ft_putnbr(ft_count_if(arr, &ft_find_separator));	/* Печатаем результат работы функции 'ft_count_if' */
	ft_putchar('\n');

    return (0);						/* Возвращаем 0 и завершаем программу */
}