/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_fight.h                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/05/12 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/09/28 19:24:44 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/*         команда для компиляции и одновременного запуска                    */
/*                                                                            */
/*  gcc -Wall -Werror -Wextra test.c && chmod +x ./a.out && ./a.out           */
/* ************************************************************************** */
/* ************************************************************************** */

#ifndef __FT_FIGHT_H
# define __FT_FIGHT_H
# define KICK 'k'
# define PUNCH 'p'
# define HEADBUTT 'h'
# include <unistd.h>

void	ft_putchar(char c);
void	ft_putstr(char *str);
void	ft_fight(t_perso *attacker, t_perso *defense, char attack);


#endif

