/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_join.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************
 *
 * 
 *	• Напишите функцию "ft_join", которая объединит в одну символьную строку 
 *	массив, переданный в параметре. Аргумент разделитель будет служить 
 *	«связующим звеном» между элементами
 * 
 *	• Эта функция будет прототипирована следующим образом:
 * 									char	*ft_join(char **tab, char *sep)
 * 
 * 	P.S  Активный бит = 1
 * 
 * #########################################################################
 * P.S Про операции с побитовыми сдвигами читать тут:
 * 									https://metanit.com/cpp/tutorial/2.8.php
 * 								https://learnc.info/c/bitwise_operators.html
 * #########################################################################
 * 
 * 
 * ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */

#include <stdlib.h>

static int	tab_size(char **tab)
{
	int		i;
	int		j;
	int		size;

	i = 0;
	j = 1;
	size = 0;
	while (tab && tab[j])
	{
		while (tab && tab[j][i])
			i++;
		size += i + 1;
		j++;
		i = 0;
	}
	size += j;
	return (size);
}

char		*ft_join(char **tab, char *sep)
{
	int		i;
	int		k;
	int		s;
	int		size;
	char	*str;

	i = 1;
	k = 0;
	s = 0;
	size = ft_size(tab);
	str = (char*)malloc(sizeof(char) * size + 1);
	while (s < (size - 1) && tab[i])
	{
		while (tab && tab[i][k])
			str[s++] = tab[i][k++];
		str[s++] = *sep;
		i++;
		k = 0;
	}
	str[s] = '\0';
	return (str);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */
