/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   0-2____aff_z.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/01/03 21:41:18 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */



/* ************************************************************************** */
/* **************************************************************************	
	

Assignment name  : aff_z
Expected files   : aff_z.c
Allowed functions: write
--------------------------------------------------------------------------------

Напишите программу, которая принимает строку и отображает в ней первый символ «z», 
за которым следует новая строка. Если в строке нет символов «z», программа просто 
записывает новую строку. Если количество параметров не равно 1, программа 
отображает «z», за которым следует новая строка.


Пример:

$> ./aff_z "zbc" | cat -e
z$
$> ./aff_z "dubO z POIL" | cat -e
z$
$> ./aff_z "aa sent le poney" | cat -e
$
$> ./aff_z | cat -e
z$


   ************************************************************************** */
/* ************************************************************************** */




#include <unistd.h>

int		main(int argc, char *argv[])
{
	int		i;

	i = 0;
	if (argc == 2)
	{
		while (argv[1][i])
		{
			if (argv[1][i] == 'z')
			{
				write(1, "z", 1);
				break ;
			}
			i++;
		}
	}
	else
		write(1, "z", 1);
    
	write(1, "\n", 1);
	return (0);
}



/* ************************************************************************** */
/* ****************************_OR_THAT:)_*********************************** */
/* ************************************************************************** */




#include <unistd.h>

int		main(int argc, char *argv[])
{
	int		i;

	i = 0;
	if (argc != 2)
		write(1, "z", 1);
	else
	{
		while (argv[1][i])
		{
			if (argv[1][i] == 'z')
			{
				write(1, "z", 1);
				break ;
			}
			i++;
		}
		
	}
	write(1, "\n", 1);
	return (0);
}
