/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ulstr.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: exam <RTFM@42.fr>                          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************


Assignment name  : fizzbuzz
Expected files   : fizzbuzz.c
Allowed functions: write
--------------------------------------------------------------------------------

Напишите программу, которая печатает числа от 1 до 100, разделенные символом новой строки.

Если число кратно 3, вместо этого печатается «fizz».

Если число кратно 5, вместо этого выводится «жужжание».

Если число одновременно кратно 3 и кратно 5, вместо этого выводится «fizzbuzz».


Пример:

$>./fizzbuzz
1
2
fizz
4
buzz
fizz
7
8
fizz
buzz
11
fizz
13
14
fizzbuzz
[...]
97
98
fizz
buzz
$> 



   ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */

#include <unistd.h>

int		main(int argc, char *argv[])/* здесь принимаем количество строк в массиве и сам массив со строками */
{	
	int i;							/* для начала обьявим переменную для счетчика */

	if (argc != 2)					/* Если кроме имени программы в аргументах ничего нет */
	{
		write(1,'\n',1);			/* то печатаем символ переноса строки */
		return (0);					/* и завершаем программу */
	}
	i = 0;							/* Инициализируем счетчик нулем чтобы начать с нулевой ячейки массива */
	while (argv[1][i])				/* Запускаем цикл. Он пройдется по строке меняя регистр всех ее букв пока не дойдет до конца */
	{
		if (argv[1][i] >= 'A' && argv[1][i] <= 'Z')		/* Если символ Верхнего регистра */
			argv[1][i] = argv[1][i] + 32;				/* то прибавляем к нему 32 чтоб переделать символ в нижний регистр */
		else if (argv[1][i] >= 'a' && argv[1][i] <= 'z')/* Если символ нижнего регистра */
			argv[1][i] = argv[1][i] - 32;				/* то вычитаем из него 32 чтоб переделать символ в Верхний регистр */
		write(1, &argv[1][i], 1);						/* Печатаем ячейку массива которую мы изменили */
		i++;											/* Увеличиваем счетчик что бы перейти к след ячейке */
	}
	write(1, "\n", 1);				/* Печатаем символ перехода на новую строку */
	return (0);						/* Завершаем программу */
}

/* ************************************************************************** */
/* ********************************_OR_THAT_:)******************************* */
/* ************************************************************************** */


#include <unistd.h>

int		main(int argc, char *argv[])
{
	int		i;
	char	letter;

	i = 0;
	if (argc == 2)
	{
		while(argv[1][i])
		{
			letter = argv[1][i];
			if (argv[1][i] >= 'A' && 'Z' >= argv[1][i])
				letter += 32;
			if (argv[1][i] >= 'a' && 'z' >= argv[1][i])
				letter -= 32;
			write(1, &letter, 1);
			i += 1;
		}
	}
	write(1, "\n", 1);
	return (0);
}
