/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strlen.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: exam <marvin@42.fr>                        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2017/07/16 19:04:24 by exam              #+#    #+#             */
/*   Updated: 2017/07/16 19:07:54 by exam             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */



/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************

Assignment name  : ft_strlen
Expected files   : ft_strlen.c
Allowed functions: 
--------------------------------------------------------------------------------

Write a function that returns the length of a string.
Напишите функцию, которая возвращает длину строки.

Your function must be declared as follows:
Ваша функция должна быть объявлена ​​следующим образом:

int	ft_strlen(char *str);


   ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


/* Эта функция считает количество символов в строке(массиве символов) */

int		ft_strlen(char *str)	/* принимаем адрес строки (первого элемента массива) и сохраняем в указателе */
{
	int i;						/* обьявляем счетчик с помощью которого будем перемещатся по массиву символов вперед*/

	i = 0;						/* инициализуем счетчик нулем чтобы отталкиваться от нулевой ячейки массива символов и двигаться по массиву вперед */
	while (str[i] != '\0')		/* Проверяем является ли символ в этой ячейки завершающим нулем '\0'. Если да то завершаем цикл, если нет то запускаем содержимое цикла */
		i++;
	return (i);					/*Если цикл прекращается программа идет к след нструкции которая у нас return (i); */
								/* Она возвращает число которое указывает на количество элементов в массиве */
}


/* ************************************************************************** */
/* ********************************_OR_THAT_:)******************************* */
/* ************************************************************************** */


int	ft_strlen(char *str)
{
	int n;

	n = 0;
	while (*str != '\0')
	{
		str++;
		n++;
	}
	return (n);
}