/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   1-0____ft_strlen.c                                 :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/01/03 21:59:32 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */



/* ************************************************************************** */
/* ************************************************************************** **

Assignment name  : ft_strlen
Expected files   : ft_strlen.c
Allowed functions: 
--------------------------------------------------------------------------------

Создайте функцию, которая считает и возвращает количество символов в строке.


Ваша функция должна быть объявлена ​​следующим образом:

int	ft_strlen(char *str);


** ************************************************************************** */
/* ************************************************************************** */


/* Эта функция считает количество символов в строке(массиве символов) */

int		ft_strlen(char *str)	/* принимаем адрес строки (первого элемента массива) и сохраняем в указателе */
{
	int i;						/* обьявляем счетчик с помощью которого будем перемещатся по массиву символов вперед*/

	i = 0;						/* инициализуем счетчик нулем чтобы отталкиваться от нулевой ячейки массива символов и двигаться по массиву вперед */
	while (str[i] != '\0')		/* Проверяем является ли символ в этой ячейки завершающим нулем '\0'. Если да то завершаем цикл, если нет то запускаем содержимое цикла */
		i++;
	return (i);					/*Если цикл прекращается программа идет к след нструкции которая у нас return (i); */
								/* Она возвращает число которое указывает на количество элементов в массиве */
}

/* ************************************************************************** */
/* ********************************_OR_THAT_:)******************************* */
/* ************************************************************************** */


int	ft_strlen(char *str)
{
	int i;

	i = 0;
	while (str[i])
		i++;
	return (i);
}


/* ************************************************************************** */
/* ********************************_OR_THAT_:)******************************* */
/* ************************************************************************** */


int	ft_strlen(char *str)
{
	int n;

	n = 0;
	while (*str != '\0')
	{
		str++;
		n++;
	}
	return (n);
}


