/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   rotone.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: exam <RTFM@42.fr>                          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************


Assignment name  : rotone
Expected files   : rotone.c
Allowed functions: write
--------------------------------------------------------------------------------


Напишите программу, которая берет строку и отображает ее, заменяя каждую
из ее букв на следующую в алфавитном порядке.
«z» становится «a», а «Z» становится «A». Дело остается без изменений.
За выходом последует новая строка.


Если количество аргументов не равно 1, программа отображает новую строку.


Пример:

$>./rotone "abc"
bcd
$>./rotone "Les stagiaires du staff ne sentent pas toujours tres bon." | cat -e
Mft tubhjbjsft ev tubgg of tfoufou qbt upvkpvst usft cpo.$
$>./rotone "AkjhZ zLKIJz , 23y " | cat -e
BlkiA aMLJKa , 23z $
$>./rotone | cat -e
$
$>
$>./rotone "" | cat -e
$
$>


   ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


#include <unistd.h>

int		main(int argc, char *argv[])	/* здесь принимаем количество строк в массиве и сам массив со строками */
{
	int		i;							/* для начала обьявим переменную для счетчика */
	
	i = 0;								/* инициализируем переменную для счетчика нулем */
	if (argc == 2)						/* Проверяем есть ли там кроме имени программы в аргументах еще одна строка в которой мы хотим
										 * изменить буквы. Если строки две то запускаем процесс изменения одной буквы на следующую */
	{
		while (argv[1][i])				/* Запускаем цикл. который пройдется по строке изменяя каждую букву на следующую и печатая ее пока не дойдет до конца */
		{
			if (argv[1][i] >= 'A' && argv[1][i] <= 'Y')		/* Если буква Верхнего регистра меняем ее на ледующую прибавляя один */
				argv[1][i] += 1;
			if (argv[1][i] >= 'a' && argv[1][i] <= 'y')		/* Если буква нижнего регистра меняем ее на ледующую прибавляя один */
				argv[1][i] += 1;
			if (argv[1][i] == 'z' || argv[1][i] == 'Z')		/* Если буква последняя в алфавите то вычитаем из нее 25 чтоб вернуться к началу и напечатать первую */
				argv[1][i] -= 25;
			write(1, &argv[1][i], 1);						/* Печатаем букву которую мы изменили */
			i++;											/* Увеличиваем счетчик и переходим к след ячейке массива */
		}
	}
	write(1, "\n", 1);					/* Печатаем символ перехода на новую строку */
	return (0);							/* Завершаем программу */
}


/* ************************************************************************** */
/* ********************************_OR_THAT_:)******************************* */
/* ************************************************************************** */


#include <unistd.h>

int		main(int argc, char **argv)
{
	int i;

	if (argc != 2)
	{
		write(1, "\n", 1);
		return (0);
	}
	else
	{
		i = 0;
		while (argv[1][i] != '\0')
		{
			if (argv[1][i] > 64 && argv[1][i] < 90)
				argv[1][i]++;
			else if (argv[1][i] > 96 && argv[1][i] < 122)
				argv[1][i]++;
			else if (argv[1][i] == 90 || argv[1][i] == 122)
				argv[1][i] -= 25;
			i++;
		}
		i = 0;
		while (argv[1][i] != '\0')
		{
			write(1, argv[1][i], 1);
			i++;
		}
		write(1, "\n", 1);
	}
}
