/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   swap_bits.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: exam <jaleman@student.42.us.org>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2016/11/15 01:25:26 by exam              #+#    #+#             */
/*   Updated: 2016/11/15 01:25:26 by exam             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************

Assignment name  : swap_bits
Expected files   : swap_bits.c
Allowed functions:
--------------------------------------------------------------------------------

Write a function that takes a byte, swaps its halves (like the example) and
returns the result.
Напишите функцию, которая берет байт, меняет свои половины (как в примере) и возвращает результат.

Your function must be declared as follows:
Ваша функция должна быть объявлена ​​следующим образом:


unsigned char	swap_bits(unsigned char octet);


Example:
Пример:


  1 byte
_____________
 0100 | 0001
     \ /
     / \
 0001 | 0100



/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */

unsigned char	swap_bits(unsigned char c)
{
	return ((c >> 4) | (c << 4));
}

