/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_atoi.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: exam <RTFM@42.fr>                          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */



/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************


Assignment name  : ft_atoi
Expected files   : ft_atoi.c
Allowed functions: None
--------------------------------------------------------------------------------

Напишите функцию, которая преобразует строковый аргумент str в целое число (тип int) и возвращает его.

Он работает так же, как стандартная функция atoi (const char * str), смотрите man.


Ваша функция должна быть объявлена ​​следующим образом:

int	ft_atoi(const char *str);


   ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int		ft_atoi(char *str)	/* Принимаем адрес массива символов */
{
	int	i;					/* обьявляем переменную для вычисления позиции ячейки массива от начала к концу */
	int	negativ;			/* обьявляем переменную для хранения информации от знаке числа */
	int	number;				/* обьявляем переменную для хранения самого числа полученного из строки */

	i = 0;					/* Инициализируем перменную чтобы начать просмотр массива с 0 позиции */
	negativ = 0;			/* Инициализируем перменную нулем предположив что число положителное */
	number = 0;				/* Инициализируем перменную нулем для прибавления в нее добытого числа*/

	/* проверим не лежат ли в этой ячейке массива ненужные символы если они там лежат то пропустим их
	 *  и перейдем к след позиции */
	while ((str[i] == ' ') || (str[i] == '\t') || (str[i] == '\n')
		|| (str[i] == '\v') || (str[i] == '\f') || (str[i] == '\r'))
		i++;
	/* проверим лежит ли в след ячейке массива знака числа, символ'-' 
	 * если он там то в переменной negativ указываем то что это число 
	 * отрицательное и переходим к след позиции*/
	if (str[i] == '-')
		negativ = 1;
	if ((str[i] == '-') || (str[i] == '+'))
		i++;

	/* Наконец дойдя до места в массиве где начинается число мы можем его вывести его от туда
	 * и сохранить в целочисленную переменную number */
	/* ВОТ ТАК */
	while (str[i] >= '0' && str[i] <= '9')
	{
		number *= 10;					/* умножая на 10 мы освобождаем место для след цифры */
		number += ((int)str[i] - 48);	/* туда где появился 0 прибавляем число которое мы вытащили из строки */
		i++;							/* и переходим к след позиции*/
	}

	/* Дальше перед тем как вернуть число которе мы добыли из строки
	 * нужно установить для него тот знак который мы нашли */
	if (negativ == 1)					/* Проверяем, узнали ли мы что число отрицательное */
		return (-number);				/* если число трицательное добавим к нему минус */
	else
		return (number);				/* если чило положительное возвращаем как есть */
}



/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int			ft_atoi(char *str)
{
	int		v;
	int		n;

	n = 0;
	if (*str == '-')
	{
		str++;
		n = 1;
	}
	v = 0;
	while (*str != '\0')
	{
		if (*str >= '0' && *str <= '9')
			v = (v * 10) + (*str - '0');
		else
			return (0);
		str++;
	}
	return ((v > 0 && n) ? -v : v);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int	ft_atoi(char *str)
{
	int	x;
	int total;
	int is_negative;

	is_negative = 0;
	x = 0;
	total = 0;
	while (str[x] == ' ' || str[x] == '\n' || str[x] == '\r' || str[x] == '\f'
			|| str[x] == '\t' || str[x] == '\v' || str[x] == '+')
		x++;
	if (str[x] == '-')
	{
		is_negative = 1;
		x++;
	}
	while (str[x] >= '0' && str[x] <= '9')
	{
		total *= 10;
		total += ((int)str[x] - 48);
		x++;
	}
	if (is_negative)
		return (-total);
	else
		return (total);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int		ft_atoi(char *str)
{
	int		i;
	int		sign;
	int		nbr;

	i = 0;
	sign = 1;
	nbr = 0;
	if (!str[i])
		return (0);
	while (str[i] == '\t' || str[i] == '\v' || str[i] == '\n' || str[i] == '\r' \
		|| str[i] == '\f' || str[i] == ' ')
		i += 1;
	if (str[i] == '-' || str[i] == '+')
		if (str[i++] == '-')
			sign = -1;
	while (str[i] >= '0' && str[i] <= '9')
		nbr = (nbr * 10) + (str[i++] - 48);
	return (nbr * sign);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */
