/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   max.c                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: exam <evgenkarlson@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by exam              #+#    #+#             */
/*   Created: 2020/02/14 12:33:14 by exam             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************


Assignment name  : max
Expected files   : max.c
Allowed functions:
--------------------------------------------------------------------------------

Write the following function:
Напишите следующую функцию:


int		max(int* tab, unsigned int len);


The first parameter is an array of int, the second is the number of elements in
the array.
Первый параметр - это массив int, второй - количество элементов в массиве.

The function returns the largest number found in the array.
Функция возвращает наибольшее число, найденное в массиве.

If the array is empty, the function returns 0.
Если массив пуст, функция возвращает 0.


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int		max(int *tab, unsigned int len)
{
	int		i;
	int		max_value;

	if (!tab)
		return (0);
	i = 0;
	while (len--)
	{
		if (tab[i] > tab[i + 1])
			max_value = tab[i];
		i += 1;
	}
	return (max_value);
}
