/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strcspn.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: exam <RTFM@42.fr>                          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** 

Assignment name	: ft_strcspn
Expected files	: ft_strcspn.c
Allowed functions: None
---------------------------------------------------------------

Точно воспроизведите поведение функции sstrcspn(man strcspn).


Функция должна быть обьявлена следующим образом:

size_t	ft_strcspn(const char *s, const char *reject);

/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */

#include <string.h>

char	*ft_strchr(const char *s, int c)
{
	while (*s != '\0')
	{
		if (*s == c)
			return ((char *)s);
		++s;
	}
	return (0);
}

size_t	ft_strcspn(const char *s, const char *reject)
{
	size_t i = 0;

	while (s[i] != '\0')
	{
		if (ft_strchr(reject, s[i]) != 0)
			break;
		++i;
	}
	return (i);
}

//---------------------------------------------------------------
// #include <stdio.h>
// int	main(void)
// {
// 	char haystack[] = "This is a test string";
// 	char accept[] = "tga";

// 	printf("%zu\n", ft_strcspn(haystack, accept));
// }
