/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   2-2____ft_strpbrk.c                                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/01/09 00:35:31 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** 

Assignment name	: ft_strpbrk
Expected files	: ft_strpbrk.c
Allowed functions: None
---------------------------------------------------------------

Точно воспроизведите поведение функции strpbrk (man strpbrk).

Функция должна быть обьявлена следующим образом:

char	*ft_strpbrk(const char *s1, const char *s2);

** ************************************************************************** */
/* ************************************************************************** */


char	*ft_strchr(const char *s, int c)
{
	while (*s)
	{
		if (*s == c)
			return ((char *)s);
		s++;
	}
	return ((void *)0);
}

char	*ft_strpbrk(const char *s1, const char *s2)
{
	while (*s1)
	{
		if (ft_strchr(s2, *s1))
			return ((char *)s1);
		s1++;
	}
	return ((void *)0);
}


/* ************************************************************************** **


P.S 


Функция strpbrk() возвращает указатель на символ в s, соответствующий одному 
из символов в наборе accept, или NULL, если такого символа нет в строке.  


int		main(void)
{
   // Массив со строкой для поиска
   char str[] = "1234567890";

   // Набор символов, которые не должны входить в искомый сегмент
   char sym[] = "9876";
  
   // Определяем длину начального сегмента, не содержащего символы “9876”
   printf ("\"%s\" - Кусок первой строки в котором впервые встречаются символы из второй строки.\n", ft_strpbrk(str,sym));

   return (0);
}


Вывод в консоль:

"67890" - Кусок первой строки в котором впервые встречаются символы из второй строки.


** ************************************************************************** */