/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   2-2____snake_to_camel.c                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/02/16 23:47:09 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** **


Assignment name  : snake_to_camel
Expected files   : snake_to_camel.c
Allowed functions: malloc, free, realloc, write
--------------------------------------------------------------------------------


Напишите программу, которая принимает одну строку в формате snake_case и преобразует ее в строку в формате lowerCamelCase.

Строка snake_case - это строка, в которой каждое слово написано в нижнем регистре и разделено знаком подчеркивания «_».

Строка lowerCamelCase - это строка, в которой каждое слово начинается с заглавной буквы, за исключением первого.


Пример:

$>./camel_to_snake "here_is_a_snake_case_word"
hereIsASnakeCaseWord
$>./camel_to_snake "hello_world" | cat -e
helloWorld$
$>./camel_to_snake | cat -e
$


** ************************************************************************** */
/* ************************************************************************** */

#include <unistd.h>

void	snake_to_camel(char *str)
{
	while (*str != '\0')
	{
		if (*str == '_')
		{
			++str;
			*str = *str - ('a' - 'A');
		}
		write(1, str, 1);
		++str;
	}
}

int	main(int argc, char **argv)
{
	if (argc == 2)
		snake_to_camel(argv[1]);
	write(1, "\n", 1);
	return (0);
}
