/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   2-4____print_bits.c                                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/02/16 23:36:50 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */



/* ************************************************************************** */
/* ************************************************************************** **


Assignment name  : print_bits
Expected files   : print_bits.c
Allowed functions: write
--------------------------------------------------------------------------------

Напишите функцию, которая берет байт и печатает его в двоичном формате БЕЗ НОВОЙ ЛИНИИ В КОНЦЕ.


Ваша функция должна быть объявлена ​​следующим образом:

void	print_bits(unsigned char octet);


Например, если вы передадите 2 в print_bits, будет напечатано «00000010»


** ************************************************************************** */
/* ************************************************************************** */


#include <unistd.h>

void	print_bits(unsigned char octet)
{
	int				i;
	unsigned char	bit;

	i = 8;
	while (i--)
	{
		bit = ((octet >> i) & 1) + '0';
		write(1, &bit, 1);
	}
}
