/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strcmp.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: exam <evgenkarlson@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by exam              #+#    #+#             */
/*   Created: 2020/02/14 12:33:14 by exam             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** 

Assignment name  : ft_strcmp
Expected files   : ft_strcmp.c
Allowed functions:
--------------------------------------------------------------------------------

Reproduce the behavior of the function strcmp (man strcmp).
Воспроизведите поведение функции strcmp (man strcmp).

Эта функция сравнивает символы двух строк, s1 и s2 начиная с первых символов.
Это продолжается до тех пор, пока не будут найдены различные символы или 
не будет достигнут конец строки.

Если все символы строк совпали, то возвращается 0.

Если при сравнении встретились отличающиеся символы, то сравнение прекращается
и возвращается отрицательное или положительное число, в зависимости от того 
больше или меньше код символа строки s1, кода символа строки s2 на той же 
позиции (см. возвращаемые значения).

Если строки разной длины, возвращается положительное число, если строка s1
длиннее строки s2, или отрицательное число, если строка s2 длиннее строки s1.

Your function must be declared as follows:
Ваша функция должна быть объявлена ​​следующим образом:

int    ft_strcmp(char *s1, char *s2);


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int	ft_strcmp(char *s1, char *s2)
{
	int i;

	i = 0;
	while (s1[i] == s2[i])
	{
		if (!s1[i] && !s2[i])
			return (0);
		i++;
	}
	return (s1[i] - s2[i]);
}


/* ************************************************************************** */
/* ********************************_OR_THAT_:)******************************* */
/* ************************************************************************** */


int	ft_strcmp(char *s1, char *s2)
{
	int i;

	i = 0;
	while (s1[i] == s2[i])
	{
		if (s1[i] == '\0' && s2[i] == '\0')
			return (0);
		i++;
	}
	return (s1[i] - s2[i]);
}

/* ************************************************************************** */
/* ********************************_OR_THAT_:)******************************* */
/* ************************************************************************** */


int	ft_strcmp(char *s1, char *s2)
{
	int	i;

	i = 0;
	while (s1[i] || s2[i])
	{
		if (s1[i] < s2[i])
			return (-1);
		if (s1[i] > s2[i])
			return (1);
		i++;
	}
	return (0);
}

/* ************************************************************************** */
/* ************************************_ИЛИ_********************************* */
/* ************************************************************************** */


int		ft_strcmp(char *s1, char *s2)
{
	while (*s1 && (*s1 == *s2))
	{
		s1++;
		s2++;
	}
	return (*(unsigned char *)s1 - *(unsigned char *)s2);
}

/* ************************************************************************** */
/* ************************************_ИЛИ_********************************* */
/* ************************************************************************** */

int		ft_strcmp(char *s1, char *s2)
{
	while (*s1++ == *s2++)
		if (*s1 == '\0' && *s2 == '\0')
			return (0);
	return (*--s1 - *--s2);
}


/* ************************************************************************** */
/* ************************************_ИЛИ_********************************* */
/* ************************************************************************** */

int ft_strcmp(char *s1, char *s2)
{
	int	i;

	i = 0;
	while (s1[i] || s2[i])
	{
		if (s1[i] != s2[i])
			return (s1[i] - s2[i]);
		i++;
	}
	return (0);
}


/* ************************************************************************** */
/* ************************************_ИЛИ_********************************* */
/* ************************************************************************** */

int		ft_strcmp(char *s1, char *s2)
{
	while (*s1++ == *s2++)
		if (*s1 == '\0' && *s2 == '\0')
			return (0);
	return (*--s1 - *--s2);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */
