/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   3-0____add_prime_sum.c                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/01/19 00:29:24 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** **

Assignment name  : add_prime_sum
Expected files   : add_prime_sum.c
Allowed functions: write, exit
--------------------------------------------------------------------------------

Напишите программу, которая принимает в качестве аргумента положительное целое
число и отображает сумму всех простых чисел, меньших или равных ей, за которыми 
следует новая строка.

Если количество аргументов не равно 1 или аргумент не является положительным 
числом, просто отобразите 0, а затем новую строку.

Да, примеры верны.


Примеры:

$>./add_prime_sum 5
10
$>./add_prime_sum 7 | cat -e
17$
$>./add_prime_sum | cat -e
0$
$>


** ************************************************************************** */
/* ************************************************************************** */


#include <unistd.h>

void	ft_putchar(char c)				/* функция печати символа */
{
	write(1, &c, 1);
}

void	ft_putnbr(int n)				/* функция печати числа */
{
	if (n < 0)
	{
		n = -n;
		ft_putchar('-');
	}
	if (n >= 10)
		ft_putnbr(n / 10);
	ft_putchar((n % 10) + '0');
}

int		ft_atoi(char *s)				/* функция получает из строки число */
{
	int		num;
	int		sign;

	sign = 1;
	num = 0;
	while (*s == '\t' || *s == '\n' || *s == '\v' || \
			*s == '\f' || *s == '\r' || *s == ' ')
		s++;
	if (*s == '-')
		sign = -1;
	while ((*s == '-') || (*s == '+'))
		s++;
	while (*s && *s >= '0' && *s <= '9')
		num = (num * 10) + ((int)(*(s++)) - '0');
	return (num * sign);
}

int		ft_is_prime( int nb )			/* функция проверки числа на простоту */
{
	int i;

	if (nb < 2)
		return (0);
	i = 2;
	while (i <= (nb / i))
	{
		if ((nb % i) == 0) 
			return (0);
		i++;
	}
	return (1);
}

int		add_prime_sum(int nb)			/* функция считает сумму всех простых 
										** простых чисел, которые появляются 
										** перед текущим простым числом */
{
	int		sum;

	sum = 0;
	while (nb > 1)
	{
		if (ft_is_prime(nb))
			sum += nb;
		nb--;
	}
	return (sum);
}

int		main(int argc, char *argv[])
{
	if (argc == 2)
		ft_putnbr(add_prime_sum(ft_atoi(argv[1])));
	ft_putchar('\n');
	return (0);
}

/* ************************************************************************** **
**                    Отрывок из статьи о простых числах
**
**                   https://postnauka.ru/longreads/155310
**
** ************************************************************************** */

/* ************************************************************************** **
**
** https://zen.yandex.ru/media/mathematic/prosteishee-i-legendarnoe-resheto-eratosfena-ego-prohodiat-v-5-klasse-5f958e9a4dcc5c613ce51830
**
** ************************************************************************** **
**
** https://stackoverflow.com/questions/62150130/algorithm-of-checking-if-the-number-is-prime
**
** P.S. Число, которое не является простым, будет делиться хотя бы на одно 
** простое число.  Следовательно, способ ускорить алгоритм (за счет памяти)
** состоял бы в том, чтобы сохранить список простых чисел, с которыми вы уже 
** столкнулись, и только проверить, делит ли какое-либо из них число, которое 
** вы в настоящее время проверяете, на каждой итерации.
**
/* ************************************************************************** */
/* ************************************************************************** */
