/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   3-0____hidenp.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/02/16 23:36:44 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** **


Assignment name  : hidenp
Expected files   : hidenp.c
Allowed functions: write
--------------------------------------------------------------------------------

Напишите программу с именем hidenp, которая принимает две строки и отображает 1,
за которым следует новая строка, если первая строка скрыта во второй, в противном
случае отображается 0, за которой следует новая строка.

Пусть s1 и s2 - строки. Мы говорим, что s1 скрыт в s2, в том случае если можно
найти каждый символ из s1 в s2, в том же порядке, в каком они появляются в s1.

Также пустая строка скрыта в любой строке.

Если количество параметров не равно 2, программа отображает новую строку.


Примеры:

$>./hidenp "fgex.;" "tyf34gdgf;'ektufjhgdgex.;.;rtjynur6" | cat -e
1$
$>./hidenp "abc" "2altrb53c.sse" | cat -e
1$
$>./hidenp "abc" "btarc" | cat -e
0$
$>./hidenp | cat -e
$
$>


** ************************************************************************** */
/* ************************************************************************** */


#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

int		ft_hidenp(char *s1, char *s2)
{
	if (!(*s1))
			return (1);
	while (*s1 && *s2)
	{
		if (*s1 == *s2)
			s1++;
		if (!(*s1))
			return (1);
		s2++;
	}
	return (0);
}

int		main(int argc, char **argv)
{
	if (argc == 3)
		ft_putchar(ft_hidenp(argv[1], argv[2]) + '0');
	ft_putchar('\n');
	return (0);
}




/* ************************************************************************** */
/* ************************************************************************** */



#include <unistd.h>

int		ft_strcmp(char *s1, char *s2)
{
	while (*s2 && (*s1 == *s2))
	{
		s1 += 1;
		s2 += 1;
	}
	return (*s1 - *s2);
}

int		main(int argc, char *argv[])
{
	if (argc == 3)
	{
		int		i;
		int		j;
		char	str_hidenp[4096];

		i = 0;
		j = 0;
		while (argv[2][j])
		{
			if (argv[1][i] == argv[2][j])
				i++;
			j++;
		}
		if (!ft_strcmp(argv[1], str_hidenp))
			write(1, "1", 1);
		else
			write(1, "0", 1);
	}
	write(1, "\n", 1);
	return (0);
}
