/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   4-0____fprime.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2016/11/22 00:59:02 by exam              #+#    #+#             */
/*   Updated: 2021/01/21 02:06:49 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */



/* ************************************************************************** */
/* ************************************************************************** **


Assignment name  : fprime
Expected files   : fprime.c
Allowed functions: printf, atoi
--------------------------------------------------------------------------------

Напишите программу, которая принимает положительное значение int и отображает его 
основные факторы на стандартном выводе, после чего следует новая строка.

Коэффициенты должны отображаться в порядке возрастания и разделяться знаком «*»,
чтобы выражение в выходных данных давало правильный результат.

Если количество параметров не равно 1, просто отобразите новую строку.

Ввод, когда он есть, будет действительным.

Примеры:


$> ./fprime 225225 | cat -e
3*3*5*5*7*11*13$
$> ./fprime 8333325 | cat -e
3*3*5*5*7*11*13*37$
$> ./fprime 9539 | cat -e
9539$
$> ./fprime 804577 | cat -e
804577$
$> ./fprime 42 | cat -e
2*3*7$
$> ./fprime 1 | cat -e
1$
$> ./fprime | cat -e
$
$> ./fprime 42 21 | cat -e
$
$>


** ************************************************************************** */
/* ************************************************************************** */


#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

void	ft_putstr(char *str)
{
	int i;

	i = 0;
	while (str[i])
		i++;
	write(1, str, i);
}

void	ft_putnbr(int n)
{
	if (n < 0)
	{
		n = -n;
		ft_putchar('-');
	}
	if (n >= 10)
		ft_putnbr(n / 10);
	ft_putchar((n % 10) + '0');
}

int		ft_atoi(char *s)
{
	int		num;
	int		sign;

	sign = 1;
	num = 0;
	while (*s == '\t' || *s == '\n' || *s == '\v' || \
			*s == '\f' || *s == '\r' || *s == ' ')
		s++;
	if (*s == '-')
		sign = -1;
	while ((*s == '-') || (*s == '+'))
		s++;
	while (*s && *s >= '0' && *s <= '9')
		num = (num * 10) + ((int)(*(s++)) - '0');
	return (num * sign);
}

void	fprime(int nbr)
{
	int		i;

	i = 2;
	if (nbr == 1)
		ft_putchar('1');
	while (nbr >= i)
	{
		if (nbr % i == 0)
		{
			ft_putnbr(i);
			if (nbr == i)
				break;
			else
				ft_putchar('*');
			nbr /= i;
			i = 2;
		}
		i++;
	}
}

int		main(int argc, char *argv[])
{
	if (argc == 2)
		fprime(ft_atoi(argv[1]));
	ft_putchar('\n');
	return (0);
}
