/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   4-2____flood_fill.c                                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/02/16 23:49:13 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** **

Assignment name  : flood_fill
Expected files   : *.c, *.h
Allowed functions: -
--------------------------------------------------------------------------------

Напишите функцию, которая принимает 'char **' как двумерный массив типа 'char',
также параметр 'size' типа 't_point', как размер этого массива, и параметр
'begin' типа 't_point', как начальную точку.

Начиная с элемента 'begin' типа 't_point', эта функция заполняет всю зону,
заменяя символы внутри на символ 'F'. Зона - это группа одного и того же
символа, ограниченная по горизонтали и вертикали другими символами или
границей массива.


Функция 'flood_fill' не заполняет по диагонали.



Функция 'flood_fill' должна быть обьявлена следующим образом:
--------------------------------------------------------------------------------
  void  flood_fill(char **tab, t_point size, t_point begin);
--------------------------------------------------------------------------------



Структура 't_point' должна быть обьявлена следующим образом:
--------------------------------------------------------------------------------
  typedef struct  s_point
  {
    int           x;
    int           y;
  }               t_point;
--------------------------------------------------------------------------------



Пример:
--------------------------------------------------------------------------------
$> cat test.c
#include <stdlib.h>
#include <stdio.h>
#include "flood_fill.h"

char** make_area(char** zone, t_point size)
{
	char** new;

	new = malloc(sizeof(char*) * size.y);
	for (int i = 0; i < size.y; ++i)
	{
		new[i] = malloc(size.x + 1);
		for (int j = 0; j < size.x; ++j)
			new[i][j] = zone[i][j];
		new[i][size.x] = '\0';
	}

	return new;
}

int main(void)
{
	t_point size = {8, 5};
	char *zone[] = {
		"11111111",
		"10001001",
		"10010001",
		"10110001",
		"11100001",
	};

	char**  area = make_area(zone, size);
	for (int i = 0; i < size.y; ++i)
		printf("%s\n", area[i]);
	printf("\n");

	t_point begin = {7, 4};
	flood_fill(area, size, begin);
	for (int i = 0; i < size.y; ++i)
		printf("%s\n", area[i]);
	return (0);
}
--------------------------------------------------------------------------------


Пример:
--------------------------------------------------------------------------------
$> gcc flood_fill.c test.c -o test; ./test
11111111
10001001
10010001
10110001
11100001

FFFFFFFF
F000F00F
F00F000F
F0FF000F
FFF0000F
$> 
--------------------------------------------------------------------------------



** ************************************************************************** */
/* ************************************************************************** */





/* ************************************************************************** **
**                                                                            **
**                 the file 'flood_fill.c' will be сontains...                **
**                                                                            **
** ************************************************************************** **
** ************************************#************************************* **
** ************************************#************************************* **
** ************************************#************************************* **
** *********************************#######********************************** **
** ***********************************###************************************ **
** ************************************#************************************* **
** ************************************************************************** **

// #include "flood_fill.h"

#ifndef T_POINT_FLOOD_FILL
# define T_POINT_FLOOD_FILL

typedef struct 	s_point {
    int 		x;
    int 		y;
} 				t_point;

void	flood_fill(char **tab, t_point size, t_point begin);

#endif


void	flood_fill(char **tab, t_point size, t_point begin)
{
    while (begin.y < size.y)
    {
        while (begin.x < size.x)
        {
            if (tab[begin.y][begin.x] == '1')
				tab[begin.y][begin.x] = 'F';
            begin.x++;
        }
		begin.x = 0;
        begin.y++;
    }
}



/* ************************************************************************** */
/* ************************************************************************** */
/* ******************************...OR THAT...******************************* */
/* ************************************************************************** */
/* ************************************#************************************* */
/* ************************************#************************************* */
/* ************************************#************************************* */
/* *********************************#######********************************** */
/* ***********************************###************************************ */
/* ************************************#************************************* */
/* ************************************************************************** */


// #include "flood_fill.h"

#ifndef T_POINT_FLOOD_FILL
# define T_POINT_FLOOD_FILL

typedef struct 	s_point {
    int 		x;
    int 		y;
} 				t_point;

void	flood_fill(char **tab, t_point size, t_point begin);

#endif


void	flood_fill(char **tab, t_point size, t_point begin)
{
    char c;
    t_point p;

    c = tab[begin.y][begin.x];
    tab[begin.y][begin.x] = 'F';
    
    if (begin.y > 0 && tab[begin.y - 1][begin.x] == c)
    {
        p.x = begin.x;
        p.y = begin.y - 1;
        flood_fill(tab, size, p);
    }
    if ((begin.y < (size.y - 1)) && tab[begin.y + 1][begin.x] == c)
    {
        p.x = begin.x;
        p.y = begin.y + 1;
        flood_fill(tab, size, p);
    }
    if ((begin.x < (size.x - 1)) && tab[begin.y][begin.x + 1] == c)
    {
        p.x = begin.x + 1;
        p.y = begin.y;
        flood_fill(tab, size, p);
    }
    if (begin.x > 0 && tab[begin.y][begin.x - 1] == c)
    {
        p.x = begin.x - 1;
        p.y = begin.y;
        flood_fill(tab, size, p);
    }
}

/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** **
**                     the file 'test.c' will be сontains...                  **
** ************************************************************************** **
** ************************************#************************************* **
** ************************************#************************************* **
** ************************************#************************************* **
** *********************************#######********************************** **
** ***********************************###************************************ **
** ************************************#************************************* **
** ************************************************************************** **

// #include "flood_fill.h"
#include <unistd.h>
#include <stdlib.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

void	ft_putstr(char *str)
{
	int	i;

	i = 0;
	while (str[i])
		i++;
	write(1, str, i);
}

void print_tab(char **a, t_point size)
{
    int i;
    int j;

    i = 0;
    while (i < size.y)
    {
        j = 0;
        while (j < size.x)
        {
            ft_putchar(a[i][j]);
            j++;
        }
        i++;
        ft_putchar('\n');
    }
}

char    **make_area(char **zone, t_point size)
{
    char    **new;
    int     i;
    int     j;

    if (!(new = (char **)(malloc(sizeof(char *) * (size.y)))))
        return ((void *)0);
    i = 0;
    while (i < size.y)
    {
        if (!(new[i] = (char *)malloc(sizeof(char *) * (size.x + 1))))
            return ((void *)0);
        j = 0;
        while (j < size.x)
		{
            new[i][j] = zone[i][j];
			j++;
		}
		new[i][size.x] = '\0';
		i++;
    }
	new[size.y] = '\0';
    return (new);
}

int     main(void)
{
    t_point size = {8, 5};
    t_point begin = {0, 0};
    char **area;
    char *zone[] = {
		"11111111",
		"10001001",
		"10010001",
		"10110001",
		"11100001",
	};
    area = make_area((char **)zone, size);
    print_tab(area, size);
    flood_fill(area, size, begin);
    ft_putchar('\n');
    print_tab(area, size);
    return (0);
}

** ************************************************************************** **
** ************************************************************************** */