/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   5-2____ft_itoa_base.c                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/01/25 02:49:45 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** **


Assignment name  : ft_itoa_base
Expected files   : ft_itoa_base.c
Allowed functions: malloc
--------------------------------------------------------------------------------

Напишите функцию, которая преобразует целочисленное значение в строку с нулевым
символом в конце, используя указанную базу, и сохраняет результат в массиве char,
который вы должны выделить.

Основание выражается в виде целого числа от 2 до 16. Символами, составляющими
основание, являются цифры от 0 до 9, за которыми следует заглавная буква от A до F.

Например, основание 4 будет «0123», а основание 16 «0123456789ABCDEF».

Если base равен 10, а значение отрицательное, результирующей строке предшествует
знак минус (-). Для любой другой базы значение всегда считается без знака.


Ваша функция должна быть объявлена ​​следующим образом:

char	*ft_itoa_base(int value, int base);


** ************************************************************************** */
/* ************************************************************************** */


char	*ft_itoa_base(int value, int base)
{
	int		i;
	int		j;
	char	temp[16];
	char	*final;

	i = 0;
	if ((base >= 2))
	{
		if (value < 0)
		{
			value = -value;
			temp[i] = '-';
			i++;
		}
		while (value)
		{
			temp[i] = value % base;
			value /= base;
			i++;
		}
		if ((final = (char *)malloc(sizeof(char) * (i + 1))) == ((void *)0))
			return (((void *)0));
		if ((temp[0] == '-'))
			final[0] = temp[0];
		j = 1;
		while (i > 1)
		{
			--i;
			if (temp[i] < 10)
				final[j] = temp[i] + '0';
			if (temp[i] >= 10)
				final[j] = temp[i] - 10 + 'A';
/* ******************************************************************************** **
** SHORT:       final[j] = (temp[i] < 10) ? (temp[i] + '0') : (temp[i] - 10 + 'A'); **
** ******************************************************************************** **/
			j++;
		}
		final[j] = '\0';
	}
	return (final);	
}


/* ************************************************************************** */
/* ************************************************************************** */

