/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   is_power_of_2.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: exam <jaleman@student.42.us.org>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2017/04/15 19:47:02 by exam              #+#    #+#             */
/*   Updated: 2017/04/15 19:47:03 by exam             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */



/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** 


Assignment name  : is_power_of_2
Expected files   : is_power_of_2.c
Allowed functions: None
--------------------------------------------------------------------------------

Write a function that determines if a given number is a power of 2.
Напишите функцию, которая определяет, является ли данное число степенью 2.

This function returns 1 if the given number is a power of 2, otherwise it returns 0.
Эта функция возвращает 1, если заданное число является степенью 2, в противном случае возвращает 0.

Your function must be declared as follows:
Ваша функция должна быть объявлена ​​следующим образом:


int	    is_power_of_2(unsigned int n);


   ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int	    is_power_of_2(unsigned int n)
{
	return ((n & (-n)) == n ? 1 : 0);
}



/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int		is_power_of_2(unsigned int n)
{
	if (n == 0)
		return (0);
	while (n % 2 == 0) 
		n /= 2;
	return ((n == 1) ? 1 : 0);
}