/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strcpy.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: exam <marvin@42.fr>                        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2017/07/07 20:20:32 by exam              #+#    #+#             */
/*   Updated: 2017/07/07 20:59:42 by exam             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************


Assignment name  : ft_strcpy
Expected files   : ft_strcpy.c
Allowed functions: 
--------------------------------------------------------------------------------

Reproduce the behavior of the function strcpy (man strcpy).
Воспроизведите поведение функции strcpy (man strcpy).

Your function must be declared as follows:
Ваша функция должна быть объявлена ​​следующим образом:

char    *ft_strcpy(char *s1, char *s2);

s1 – указатель на строку, в которую будут скопированы данные.
s2 – указатель на строку источник копируемых данных.

Функция возвращает указатель на строку, в которую скопированы данные.

Функция ft_strcpy копирует данные из строки, на которую указывает аргумент s2,
в строку, на которую указывает аргумент s1, пока не встретится символ конца
строки (нулевой символ). Копирование производится вместе с символом конца строки.

Если строки перекрываются, результат копирования будет не определен.

   ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */



char    *ft_strcpy(char *s1, char *s2)	/* Принимаем адреса строк в s1  и адреса s2 */
{
	int		i;			/* обьявляем переменную для счетчика */

	i = 0;				/* инициализируем счетчик для старта с нулевой позиции */
	while (s2[i])		/* цикл будет копировать второй массив в первый пока не дойдет 
						 * до '\0' */
	{
		s1[i] = s2[i];	/* копируем символ из нулевой позиции первой строки в нулевую 
						 * позицию второй строки и дальше по мере увеличения переменной i */
		i++;			/* увеличиваем счетчик для перехода к след ячейке массива */
	}
	s1[i] = '\0';		/* если дошли до сюда значит содержимое массива скопировано и в следующей 
						 * ячейке массива нужно поставить завершающий символ */
	return (s1);		/* Возвращаем адресс строки в которую мы копировали данные */
}


/* ************************************************************************** */
/* ********************************_OR_THAT_:)******************************* */
/* ************************************************************************** */


char	*ft_strcpy(char *s1, char *s2)
{
	int i;
	int l;
	int b;
	char c;

	i = 0;
	b = 1;

	while (b)
	{
		if (s2[i] == '\0')
		{
			b = 0;
			l = i;
		}
		i++;
	}
	
	while (b <= l)
	{
		c = s2[b];
		s1[b] = c;
		b++;
	}
	return (s1);
}