/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strcapitalize.c                                 :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/10/08 01:15:51 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**
**  - Создайте функцию, которая делает первую букву каждого слова заглавной и 
**  преобразует все остальные буквы в строчные.
**
**
**  - Слово - это строка буквенно-цифровых символов.
**
**
**  - Вот как это должно быть обьявлено:
**
**       char	*ft_strcapitalize(char *str);
**
**
**  - Функция должна вернуть строку.
**
**
** ************************************************************************** **
**
**
**  - Например это:
**
**      salut, comment tu vas ? 42mots quarante-deux; cinquante+et+un
**
**
**  - Становится этим:
**
**      Salut, Comment Tu Vas ? 42mots Quarante-Deux; Cinquante+Et+Un
**
**
** ************************************************************************** **
**
**
** Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую
**
**
** ************************************************************************** */
/* ************************************************************************** */

int		iss_alpha(char c)
{
	if ((c >= 'a') && (c <= 'z'))
		return (1);
	if ((c >= 'A') && (c <= 'Z'))
		return (1);
	if ((c >= '0') && (c <= '9'))
		return (1);
	return (0);
}

int		is_maj(char c)
{
	return ((c >= 'A') && (c <= 'Z'));
}

char	is_min(char c)
{
	return ((c >= 'a') && (c <= 'z'));
}

char	*ft_strcapitalize(char *str)
{
	int	i;

	i = 0;
	while (str[i])
	{
		while (str[i] && !iss_alpha(str[i]))
			i++;
		if (str[i] && is_min(str[i]))
			str[i] = ((str[i] - 'a') + 'A');
		i++;
		while (str[i] && iss_alpha(str[i]))
		{
			if (is_maj(str[i]))
				str[i] = ((str[i] - 'A') + 'a');
			i++;
		}
	}
	return (str);
}

/* ************************************************************************** */
/* ************************************************************************** */

int		iss_alpha(char c)
{
	if ((c >= 'a') && (c <= 'z'))
		return (1);
	if ((c >= 'A') && (c <= 'Z'))
		return (1);
	if ((c >= '0') && (c <= '9'))
		return (1);
	return (0);
}

char	*ft_strcapitalize(char *str)
{
	int	i;

	i = 0;
	while (str[i])
	{
		while (str[i] && !iss_alpha(str[i]))
			i++;
		if (str[i] && ((str[i] >= 'a') && (str[i] <= 'z')))
			str[i] = ((str[i] - 'a') + 'A');
		i++;
		while (str[i] && iss_alpha(str[i]))
		{
			if ((str[i] >= 'A') && (str[i] <= 'Z'))
				str[i] = ((str[i] - 'A') + 'a');
			i++;
		}
	}
	return (str);
}

/* ************************************************************************** */
/* ************************************************************************** */

int		iss_alpha(char c)
{
	if ((c >= 'a') && (c <= 'z'))
		return (1);
	if ((c >= 'A') && (c <= 'Z'))
		return (1);
	if ((c >= '0') && (c <= '9'))
		return (1);
	return (0);
}

int		is_maj(char c)
{
	return ((c >= 'A') && (c <= 'Z'));
}

char	is_min(char c)
{
	return ((c >= 'a') && (c <= 'z'));
}

char	*ft_strcapitalize(char *str)
{
	int	i;
	int	word_new;

	i = 0;
	word_new = 1;
	while (str[i])
	{
		if (is_min(str[i]) && (word_new == 1))
			str[i] = ((str[i] - 'a') + 'A');
		else if (is_maj(str[i]) && (word_new == 0))
			str[i] = ((str[i] - 'A') + 'a');
		if (iss_alpha(str[i]))
			word_new = 0;
		else
			word_new = 1;
		i++;
	}
	return (str);
}



/* ************************************************************************** */
/* ************************************************************************** */

char	*jp_strlowcase(char *str)
{
	int	i;

	i = 0;
	while (str[i] != '\0')
	{
		if (str[i] >= 'A' && str[i] <= 'Z')
			str[i] = ((str[i] - 'A') + 'a');
		i++;
	}
	return (str);
}

char	*ft_strcapitalize(char *str)
{
	int	i;

	i = 1;
	jp_strlowcase(str);
	if (str[0] >= 'a' && str[0] <= 'z')
		str[0] = ((str[0] - 'a') + 'A');
	while (str[i])
	{
		if ((str[i] >= ' ' && str[i] <= '/') ||
			(str[i] >= ':' && str[i] <= '@'))
			if (str[i + 1] >= 'a' && str[i + 1] <= 'z')
				str[i + 1] = ((str[i + 1] - 'a') + 'A');
		i++;
	}
	return (str);
}


/* ************************************************************************** */
/* ************************************************************************** */


char	*ft_strcapitalize(char *str)
{
	int		i;
	char	c;
	int		space;

	i = 0;
	while (str[i] != '\0')
	{
		space = 1;
		if (i == 0)
			c = ';';
		else
			c = str[i - 1];
		if ((c >= 'A' && c <= 'Z') || (c >= 'a' && c <= 'z'))
			space = 0;
		if (c >= '0' && c <= '9')
			space = 0;
		if (space == 1 && str[i] >= 'a' && str[i] <= 'z')
			str[i] = str[i] - 32;
		if (space == 0 && str[i] >= 'A' && str[i] <= 'Z')
			str[i] = str[i] + 32;
		i++;
	}
	return (str);
}

/* ************************************************************************** */
/* ************************************************************************** */
