/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/10/19 18:10:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

void	ft_putstr(char *str);
void	ft_putchar(char c);

int		main(void)
{
	char *t;

	t = "GO HARD";
	ft_putstr(t);
	ft_putchar('\n');
	return (0);
}



/* ************************************************************************** **
**                                                                            **
**           Проверки работоспособности библиотеки на тестовом файле :        **
**                                                                            **
** ************************************************************************** **
**
**
**  gcc -o program.out test.c ./libft.a && chmod +x ./program.out && ./program.out
**
**
** ************************************************************************** **
**
**  ИЛИ ТАК
**
**
**  gcc test.c ./libft.a && chmod +x ./a.out && ./a.out
**
**
** ************************************************************************** **
**
**  ИЛИ ТАК
**
**
** Для компиляции нашего основного файла 'test.c' надо сообщить компилятору, 
** что надо использовать библиотеки. Чтобы компилятор знал где искать библиотеки 
** ему надо сообщить каталог, в котором они содержатся и список этих билиотек. 
** Каталог с библиотеками указывается ключом `-L`, в нашем случае библиотека 
** находится в текущем каталоге, значит путь до нее будет в виде точки (-L.). 
** Используемые библиотеки перечисляются через ключ `-l`, после которого 
** указывается название библиотеки без префикса lib и окончания .a. В нашем 
** случае этот ключ будет выглядеть, как `-lft`. Теперь все одной командой:
**
** gcc test.c -L. -lft -o program.out && chmod +x ./program.out && ./program.out
**
**
** gcc test.c -L . -lft -o program.out && chmod +x ./program.out && ./program.out
**
**
** gcc test.c -L./ -lft -o program.out && chmod +x ./program.out && ./program.out
**
**
** gcc test.c -L ./ -lft -o program.out && chmod +x ./program.out && ./program.out
**
**
** gcc test.c -L'.' -lft -o program.out && chmod +x ./program.out && ./program.out
**
**
** gcc test.c -L '.' -lft -o program.out && chmod +x ./program.out && ./program.out
**
**
** gcc test.c -L'./' -lft -o program.out && chmod +x ./program.out && ./program.out
**
**
** gcc test.c -L './' -lft -o program.out && chmod +x ./program.out && ./program.out
**
**
** ************************************************************************** */
