/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_list_reverse.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/02/16 23:42:55 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex08/
**  Файлы для сдачи: ft_list_reverse.c
**  Разрешенные функции: Никаких
**
** ************************************************************************** **
** 
** 
** 	• Создайте функцию "ft_list_reverse", которая изменяет порядок элементов 
** 	списка. Значение каждого элемента должно оставаться неизменным.
** 
**  
** 	• Остерегайтесь, в этой функции мы будем использовать наш собственный 
**  "ft_list.h".
**  
** 
** 	• Вот как эта функция должна быть объявлена :
** 
** 								void	ft_list_reverse(t_list **begin_list);
** 
** 
** ************************************************************************** */
/* ************************************************************************** */

#include "ft_list.h"

void	ft_list_reverse(t_list **begin_list)
{
	t_list	*new_start;
	t_list	*tmp;

	if ((*begin_list) || ((*begin_list)->next))
	{
		new_start = ((void *)0);
		while (*begin_list)
		{
			tmp = (*begin_list)->next;
			(*begin_list)->next = new_start;
			new_start = *begin_list;
			*begin_list = tmp;
		}
		*begin_list = new_start;
	}
}

/* ************************************************************************** */
/* ************************************************************************** */

#include "ft_list.h"

void	ft_list_reverse(t_list **begin_list)
{
	t_list	*list;
	t_list	*tmp;
	t_list	*tmp2;

	list = *begin_list;
	if (!list || !(list->next))
		return;
	tmp = list->next;
	tmp2 = list->next->next;
	list->next = ((void *)0);
	tmp->next = list;
	while (tmp2)
	{
		list = tmp;
		tmp = tmp2;
		tmp2 = tmp2->next;
		tmp->next = list;
	}
	*begin_list = tmp;
}

/* ************************************************************************** */
/* ************************************************************************** */

#include "ft_list.h"

t_list	*ft_rev_list(t_list *node)
{
	t_list *rest;

	if (!node)
		return (0);
	if (!node->next)
		return (node);
	rest = ft_rev_list(node->next);
	node->next->next = node;
	node->next = 0;
	return (rest);
}

void	ft_list_reverse(t_list **begin_list)
{
	*begin_list = ft_rev_list(*begin_list);
}

/* ************************************************************************** */
/* ************************************************************************** */

