/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   btree_create_node.c                                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/11/17 18:17:46 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex00/
**  Файлы для сдачи: btree_create_node.c, ft_btree.h	
**  Разрешенные функции: malloc
**
** ************************************************************************** **
**
** 
**	• Создайте функцию 'btree_create_node', которая создает новый элемент. Он
**  должен инициализировать свой 'item' значением аргумента, а все остальные
**  элементы значением 0.
** 
** 
**	• Функция должна возвращать адресс созданного узла.
** 
** 
**	• Вот как эта функция должна быть объявлена :
**
**										t_btree	*btree_create_node(void *item);
** 
** 
** ************************************************************************** */
/* ************************************************************************** */

#include <stdlib.h>
#include "ft_btree.h"

t_btree		*btree_create_node(void *item)
{
	t_btree		*tree;

	if ((tree = (t_btree *)malloc(sizeof(t_btree))))
	{
		tree->left = ((void *)0);
		tree->right = ((void *)0);
		tree->item = item;
	}
	return (tree);
}

/* ************************************************************************** */
/* ************************************************************************** */


#include <stdlib.h>
#include "ft_btree.h"

t_btree		*btree_create_node(void *item)
{
	t_btree		*tree;

	tree = ((void *)0);
	tree = (t_btree *)malloc(sizeof(t_btree));
	if (tree)
	{
		tree->left = ((void *)0);
		tree->right = ((void *)0);
		tree->item = item;
	}
	return (tree);
}

/* ************************************************************************** */
/* ************************************************************************** */
