/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_map.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/02/16 23:38:48 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */



/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex01/
**  Файлы для сдачи: ft_map.c	
**  Разрешенные функции: malloc
**
** ************************************************************************** **
 *
 * 
 *	• Создайте функцию "ft_map", которая для данного массива ints применяет
 *	функцию ко всем элементам массива (по порядку) и возвращает массив всех 
 *	элементов массива. значение. 
 *
 *  • Эта функция должна быть применена в соответствии с порядком массива.
 * 
 * 
 *	• Вот как эта функция должна быть объявлена :
 -------------------------------------------------------------------------------
 |				int	*ft_map(int *tab, int length, int(*f)(int))                |
 -------------------------------------------------------------------------------
 * 
 * 
 * ************************************************************************** **
 * 
 * 
 *	P.S. в этом задании вам предлагают рассмотреть тему "Указателей на функции":
 *
 * 										https://metanit.com/cpp/tutorial/4.8.php
 * 
 * 
 * ************************************************************************** */
/* ************************************************************************** */

#include <stdlib.h>

/* ************************************************************************** */

int	*ft_map(int *tab, int length, int(*f)(int))
{
	int	*mytab;
	int	i;

	if ((mytab = (int*)malloc(sizeof(*tab) * length)) == ((void *)0))
		return ((void *)0);
	i = 0;
	while (i < length)
	{
		mytab[i] = f(tab[i]);
		i++;
	}
	return (mytab);
}


/* ************************************************************************** */
/* ************************************************************************** */
