/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_list_push_strs.c                                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/02/16 23:42:08 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex05/
**  Файлы для сдачи: ft_list_push_strs.c, ft_list.h
**  Разрешенные функции: ft_create_elem
**
** ************************************************************************** **
**
** 
**	• Создайте функцию "ft_list_push_strs", которая создает новый список,
**	включающий включающий  строку, указанную элементом "str".
**	
**
**  • size - это размер массива строк strs.
**
**
**	• Первый аргумент должен быть в конце списка, а последний в начале.
**	
** 
**	• Возвращается адрес первой ссылки в списке.
**
** 
**	• Вот как эта функция должна быть объявлена :
**
**	t_list	*ft_list_push_strs(int size, char **strs);
** 
** 
** ************************************************************************** */
/* ************************************************************************** */


#include <stdlib.h>
#include "ft_list.h"

t_list	*ft_list_push_strs(int size, char **strs)
{
	t_list	*tmp;
	t_list	*list;
	int		i;

	i = 1;
	list = ft_create_elem(strs[0]);
	tmp = list;
	while (i < size)
	{
		list = ft_create_elem(strs[i]);
		list->next = tmp;
		tmp = list;
		i++;
	}
	return (list);
}

/* ************************************************************************** */
/* ************************************************************************** */


#include <stdlib.h>
#include "ft_list.h"

t_list	*ft_list_push_strs(int size, char **strs)
{
	t_list *current;
	t_list *last;
	int i;

	i = -1;
	current = ((void *)0);
	last = ((void *)0);
	while (++i < size)
	{
		current = ft_create_elem(strs[i]);
		current->next = last;
		last = current;
	}
	return (current);
}


/* ************************************************************************** */
/* ************************************************************************** */


#include <stdlib.h>
#include "ft_list.h"

t_list	*add_link(t_list *list, void *data)
{
	t_list *tmp;

	tmp = (t_list *)malloc(sizeof(t_list));
	if (tmp)
	{
		tmp->data = data;
		tmp->next = list;
	}
	return (tmp);
}

t_list	*ft_list_push_strs(int size, char **strs)
{
	t_list	*list;
	int		i;

	i = 0;
	list = ((void *)0);
	while (i < size)
		list = add_link(list, strs[i++]);
	return (list);
}


/* ************************************************************************** */
/* ************************************************************************** */
