/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_rev_params.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/10/10 18:23:11 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**  
**  
**  - Здесь мы имеем дело с программой, поэтому в вашем файле '.c' должна быть 
**  функция 'main'.
**
**  - Создайте программу, которая отображает свои собственные аргументы.
**
**  - По одному на строку в обратном порядке.
**
**  - Она должна отображать все аргументы, кроме эargv[0]'.
**
**
** ************************************************************************** **
**
**  Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую
**
** ************************************************************************** */
/* ************************************************************************** */


#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

int	main(int argc, char **argv)
{
	int	s;
	int	c;

	if (argc > 1)
	{
		s = argc - 1;
		while (s > 0)
		{
			c = 0;
			while (argv[s][c])
			{
				ft_putchar(argv[s][c]);
				c++;
			}
			ft_putchar('\n');
			s--;
		}
	}
	return (0);
}

/* ************************************************************************** */
/* ************************************************************************** */

#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

int	main(int argc, char **argv)
{
	int	s;
	int	c;

	if (argc > 1)
	{
		s = argc - 1;
		while (s > 0)
		{
			c = 0;
			while (argv[s][c])
				c++;
			write(1, argv[s], c);
			ft_putchar('\n');
			s--;
		}
	}
	return (0);
}

/* ************************************************************************** */
/* ************************************************************************** */

#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

int 	main(int argc, char *argv[])
{
	int i;

	if (argc > 1)
	{
		i = argc;
		while (i-- > 1)
		{
			while (*argv[i] != '\0')
			{
				ft_putchar(*argv[i]);
				*argv[i]++;
			}
			ft_putchar('\n');
		}
	}
	return (0);
}

/* ************************************************************************** */
/* ************************************************************************** */

#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

int		main(int argc, char *argv[])
{
	int s;
	int c;

	if (argc > 1)
	{
		s = argc - 1;
		while (s > 0)
		{
			c = 0;
			while (argv[s][c])
			{
				ft_putchar(argv[s][c]);
				c++;
			}
			ft_putchar('\n');
			s--;
		}
	}
}

/* ************************************************************************** */
/* ************************************************************************** */

#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

int		main(int argc, char *argv[])
{
	int с;


	if (argc > 1)
	{
		while (--argc)
		{
			с = 0;
			while (argv[argc][с])
				ft_putchar(argv[argc][с++]);
			ft_putchar('\n');
		}
	}
	return (0);
}

/* ************************************************************************** */
/* ************************************************************************** */
