/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_print_params.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/10/10 18:22:58 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**  
**  
**  - Здесь мы имеем дело с программой, поэтому в вашем файле '.c' должна быть 
**  функция 'main'.
**
**  - Создайте программу, которая отображает свои собственные аргументы.
**
**  - По одному на строку в том же порядке, что и в командной строке.
**
**  - Она должна отображать все аргументы, кроме эargv[0]'.
**
**  
**  - Пример:
--------------------------------------------------------------------------------

    $>./a.out test1 test2 test3
    test1
    test2
    test3
    $>

--------------------------------------------------------------------------------
**
** ************************************************************************** **
**
**  Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую
**
** ************************************************************************** */
/* ************************************************************************** */



#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

int	main(int argc, char **argv)
{
	int	s;
	int	c;
	if (argc > 1)
	{
		s = 1;
		while (s < argc)
		{
			c = 0;
			while (argv[s][c])
				ft_putchar(argv[s][c++]);
			ft_putchar('\n');
			s++;
		}
	}
	return (0);
}

/* ************************************************************************** */
/* ************************************************************************** */

#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

int	main(int argc, char **argv)
{
	int	s;
	int	c;

	if (argc > 1)
	{
		s = 1;
		while (s < argc)
		{
			c = 0;
			while (argv[s][c])
				c++;
			write(1, argv[s], c);
			ft_putchar('\n');
			s++;
		}
	}
	return (0);
}

/* ************************************************************************** */
/* ************************************************************************** */

#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

int 	main(int argc, char *argv[])
{
	int s;

	if (argc > 1)
	{
		s = 1;
		while (s < argc - 1)
		{
			while (*argv[s])
			{
				ft_putchar(*argv[s]);
				*argv[s]++;
			}
			ft_putchar('\n');
			s++;
		}
	}
	return (0);
}


/* ************************************************************************** */
/* ************************************************************************** */