/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_list_find.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/11/16 21:30:31 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex11/
**  Файлы для сдачи: ft_list_find.c, ft_list.h
**  Разрешенные функции: Никаких
**
** ************************************************************************** **
 *
 * 
 *	• Создайте функцию "ft_list_find", которая возвращает адрес первого найденого
 *  елемента списка связанных междусобой структур, у которого данные в 'data' 
 *  будут «равны» справочным данным в 'data_ref'. 
 *  Сравнение производиться с помощью 'cmp', если данные «равны» 'cmp' должна
 *  вернуть 0.
 * 
 * 
 *	• Вот как эта функция должна быть объявлена :
 *
 *		t_list	*ft_list_find(t_list *begin_list, void *data_ref, int (*cmp)());

 * 
 *	• Функция, обозначенная как 'cmp', будет использоваться следующим образом:
 * 
 * 											(*cmp)(list_ptr->data, data_ref);
 * 
 * 
 * 
 * ************************************************************************** */
/* ************************************************************************** */

#include "ft_list.h"

t_list	*ft_list_find(t_list *begin_list, void *data_ref, int (*cmp)())
{
	while (begin_list)
	{
		if ((*cmp)(begin_list->data, data_ref) == 0)
			return (begin_list);
		begin_list = begin_list->next;
	}
	return ((void *)0);
}

/* ************************************************************************** */
/* ************************************************************************** */

#include "ft_list.h"

t_list	*ft_list_find(t_list *begin_list, void *data_ref, int (*cmp)())
{
	t_list *list_ptr;

	list_ptr = begin_list;
	while (list_ptr != 0)
	{
		if ((*cmp)(list_ptr->data, data_ref) == 0)
			return (list_ptr);
		list_ptr = list_ptr->next;
	}
	return ((void *)0);
}

/* ************************************************************************** */
/* ************************************************************************** */

#include "ft_list.h"

t_list	*ft_list_find(t_list *begin_list, void *data_ref, int (*cmp)())
{
	t_list	*list_ptr;

	list_ptr = begin_list;
	while (list_ptr)
	{
		if ((*cmp)(list_ptr->data, data_ref) == 0)
			return (list_ptr);
		list_ptr = list_ptr->next;
	}
	return (list_ptr);
}

/* ************************************************************************** */
/* ************************************************************************** */
