/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_iterative_power.c                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: schapuis <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2013/08/16 14:42:37 by schapuis          #+#    #+#             */
/*   Updated: 2013/08/18 21:09:43 by schapuis         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* - Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую */

/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************


Create an iterated function that returns the value of a power applied to a number.
An power lower than 0 returns 0. Overflows don’t have to be handled.

Создайте итерационную функцию, которая возвращает значение степени, примененной к числу.
Мощность ниже 0 возвращает 0. Переполнения не должны быть обработаны.

Your function must return its result in less than two seconds.
Ваша функция должна вернуть свой результат менее чем за две секунды.


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int	ft_iterative_power(int nb, int power)
{
	int	result;

	result = 1;
	if (power < 0)
		return (0);
	if (power == 0)
		return (1);
	while (power)
	{
		result *= nb;
		power--;
	}
	return (result);
}




/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */

int		ft_iterative_power(int nb, int power)
{
	int	i;
	int	p;

	if (power < 0)
		return (0);
	if (power == 0)
		return (1);
	i = 0;
	p = nb;
	while (++i < power)
		p = p * nb;
	return (p);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int	ft_iterative_power(int nb, int power)
{
	int init;

	if (power < 0)
		return (0);
	if (power == 0)
		return (1);
	init = nb;
	while (power > 1)
	{
		init *= nb;
		power--;
	}
	return (nb);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */



int		ft_iterative_power(int nb, int power)
{
	int result;

	if (power < 0)
		return (0);
	if (power == 0)
		return (1);
	result = nb;
	while (power > 1)
	{
		result = result * nb;
		power--;
	}
	return (result);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


int		ft_iterative_power(int nb, int power)
{
	int result;

	result = 1;
	if (power < 0)
		return (0);
	if (power == 0)
		return (1);
	while (power--)
		result *= nb;
	return (result);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */
