/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strncmp.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/10/08 18:02:59 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**
**  - Воспроизвести поведение функции strncmp (man strncmp):
**
**
**  - Вот как это должно быть обьявлено:
**
**       int		ft_strncmp(char *s1, char *s2, unsigned int n);
**
**
** ************************************************************************** **
**
**
**  ft_strncmp – сравнение строк с ограничением количества сравниваемых символов.
**
**
**  Аргументы:
**
**  s1, s2 – указатели на сравниваемые строки.
**  n – количество символов для сравнения.
**
**  Возвращаемое значение:
**
**  0 – если первые 'n' символов сравниваемых строк идентичны.
**
**  Положительное число – если в первых n символах сравниваемых строк есть отличия
**  и код первого отличающегося символа в строке 's1' больше кода символа на той же  
**  позиции в строке 's2'.
** 
**  Отрицательное число – в первых n символах сравниваемых строк есть отличия и 
**  код первого отличающегося символа в строке 's1' меньше кода символа на той же
**  позиции в строке 's2'.
** 
**  Описание:
** 
**  Функция побайтно сравнивает коды символов двух строк, на которые указывают 
**  аргументы функции.
** 
**  Сравнение прекращается если встретились отличающиеся символы. При этом возвращается
**  отрицательное или положительное число (см. возвращаемые значения).
** 
**  Если были проверены n символов или обе сравниваемые строки закончились, и отличий
**  не было, то сравнение прекращается и возвращается ноль.
** 
** 
** ************************************************************************** **
**
**
** Скомпилируй файл тест. В нем можно увидеть как работает эта функция вживую
**
**
** ************************************************************************** */
/* ************************************************************************** */


int	ft_strncmp(char *s1, char *s2, unsigned int n)
{
	unsigned int	i;

	i = 0;
	while ((s1[i] || s2[i]) && (i < n))
	{
		if (s1[i] < s2[i])
			return (-1);
		if (s1[i] > s2[i])
			return (1);
		i++;
	}
	return (0);
}

/* ************************************************************************** */
/* ************************************************************************** */

int		ft_strncmp(char *s1, char *s2, unsigned int n)
{
	int	i;

	i = 0;
	while (i < n)
	{
		if (*s1 != *s2)
			return (*s1 - *s2);
		if (*s1 == '\0' && *s2 == '\0')
			return (0);
		*s1++;
		*s2++;
		i++;
	}
	return (0);
}

/* ************************************************************************** */
/* ************************************************************************** */

int		ft_strncmp(char *s1, char *s2, unsigned int n)
{
	unsigned int i;

	i = 1;
	while (*s1++ == *s2++)
	{
		if (i >= n)
			return (0);
		if (*s1 == '\0' && *s2 == '\0')
			return (0);
		i++;
	}
	return (*--s1 - *--s2);
}

/* ************************************************************************** */
/* ************************************************************************** */
