/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_split.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************

• Создайте функцию, которая разрезает одну строку символов в используя значения
  другой строки символов.
• Используйте каждый символ из строкового набора символов в качестве
  разделителя.
• Функция возвращает массив, с блоками содержащими адреса строк со словом
  между двумя разделителями. Последний элемент этого массива должен быть равен 0,
  чтобы указать конец массива.
• В вашем массиве не может быть пустых строк. Сделайте свои выводы соответственно.
• Строка, указанная в качестве аргумента, не подлежит изменению.
• Вот как это должно быть прототипировано:

	char  **ft_split(char *str, char *charset);

   ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


#include <stdlib.h>

void  ft_putchar(char c);

/* ************************************************************************** */


int		ft_strchar(char to_find, char *str)
{
	while (*str)
		if (to_find == *str++)
			return (1);
	return (0);
}

int		ft_wordcount(char *str, char *spacechar)
{
	int		i;

	i = 0;
	while (*str)
		if (ft_strchar(*str, spacechar))
			++str;
		else
		{
			++i;
			++str;
			while (*str && !ft_strchar(*str, spacechar))
				++str;
		}
	return (i);
}

char	*ft_split_w(char **str, char *spacechar)
{
	char	*bptr;
	char	*bsptr;
	char	*sptr;

	sptr = *str;
	while (ft_strchar(*sptr, spacechar))
		sptr++;
	*str = sptr;
	while (!ft_strchar(*sptr, spacechar))
		sptr++;
	if ((bptr = (char *)malloc(sptr - *str)) == ((void *)0))
		return ((void *)0);
	bsptr = bptr;
	while (sptr > *str)
		*bsptr++ = *((*str)++);
	*bsptr = '\0';
	while (**str && ft_strchar(**str, spacechar))
		(*str)++;
	return (bptr);
}

char	**ft_split(char *str, char *spacechar)
{
	char	**buffer;
	char	**bptr;
	int		i;

	i = ft_wordcount(str, spacechar);
	ft_putchar((i%10)+'0');
	if ((buffer = (char **)malloc((i + 1) * sizeof(char *))) == ((void *)0))
		return ((void *)0);
	bptr = buffer;
	while (i--)
		if ((*bptr++ = ft_split_w(&str, spacechar)) == ((void *)0))
			return ((void *)0);
	*bptr = ((void *)0);
	return (buffer);
}

/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */

