/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_split.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************

• Создайте функцию, которая разрезает строку символов в зависимости от другой
  строки символов.
• Вам придется использовать каждый символ из строкового набора символов в качестве
  разделителя.
• Функция возвращает массив, в котором каждый блок содержит адрес строки, заключенной
  между двумя разделителями. Последний элемент этого массива должен быть равен 0,
  чтобы указать конец массива.
• В вашем массиве не может быть пустых строк. Сделайте свои выводы соответственно.
• Строка, указанная в качестве аргумента, не подлежит изменению.
• Вот как это должно быть прототипировано:

	char  **ft_split(char *str, char *charset);

   ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


#include <stdlib.h>

void  ft_putchar(char c);

/* ************************************************************************** */


int   ft_isspace(char c)
{
	return (c == ' ' || c == '\n' || c == '\t');
}

int   count_words(char *str)
{
	int	count;

	count = 0;
	while (*str)
	{
		while (*str && ft_isspace(*str))
			str++;
		if (*str && !ft_isspace(*str))
		{
			count++;
			while (*str && !ft_isspace(*str))
				str++;
		}
	}
	return (count);
}

char  *malloc_word(char *str)
{
	char *word;
	int	i;

	i = 0;
	while (str[i] && !ft_isspace(str[i]))
		i++;
	word = (char *)malloc(sizeof(char) * (i + 1));
	i = 0;
	while (str[i] && !ft_isspace(str[i]))
	{
		word[i] = str[i];
		i++;
	}
	word[i] = '\0';
	return (word);
}

char	**ft_split(char *str)
{
	char **arr = (char **)malloc(sizeof(char *) * (count_words(str) + 1));

	int i = 0;
	while (*str)
	{
		while (*str && ft_isspace(*str))    /* перейти к началу нового слова */
			str++;
		if (*str && !ft_isspace(*str))
		{
			arr[i] = malloc_word(str);       /* сохранить слово в массив */
			i++;
			while (*str && !ft_isspace(*str))/* перейти к следующему пробелу */
				str++;
		}
	}
	arr[i] = NULL;
	return (arr);
}

// #include <stdio.h>

// int		main(int ac, char **av)
// {
// 	char **arr;

// 	char *phrase = "   Hello,   Flavio\t Wuensche!  ";
// 	arr = ft_split(phrase);
// 	printf("%s\n", arr[0]);
// 	printf("%s\n", arr[1]);
// 	printf("%s\n", arr[2]);
// 	printf("%s\n", arr[3]);
// }

/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */

