/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strdup.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2020/02/15 10:51:23 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/* ************************************************************************** */
/* ************************************************************************** */
/* **************************************************************************

• Воспроизвести поведение функции strdup (man strdup).

• Вот как это должно быть прототипировано:

char	*ft_strdup(char *src);

 _________________________________________________________________________________
|																				  |
|ОПИСАНИЕ																		  |
|       Функция strdup() возвращает указатель на новую строку, которая является   |
|	   дубликатом строки. Память для новой строки получается с помощью malloc(3)  |
|	   и может быть освобождена с помощью free(3).								  |
|_________________________________________________________________________________|
|																				  |
|ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ															  |
|       В случае успеха функция strdup() возвращает указатель на дублированную	  |
|	   строку. Он возвращает NULL, если недостаточно памяти, с errno, установ-	  |
|	   ленным, чтобы указать причину ошибки.									  |
|_________________________________________________________________________________|
|																				  |
|ОШИБКИ																			  |
|       Недостаточно памяти для размещения дублирующейся строки.				  |
|_________________________________________________________________________________|


   ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */


#include <stdlib.h>


int			ft_strlen(char *str)
{
	int l;

	l = 0;
	while (str[l])
		l++;
	return (l);
}

char		*ft_strdup(char *src)
{
	int		l;
	char	*dest;

	l = ft_strlen(src);
	if ((dest = malloc(sizeof(*src) * (l + 1))) == ((void *)0))
		return (((void *)0));
	while (l >= 0)
	{
		dest[l] = src[l];
		l--;
	}
	return (dest);
}



/* ************************************************************************** */
/* ******************************_ИЛИ_*************************************** */
/* ************************************************************************** */


#include <stdlib.h>

char	*ft_strdup(char *src)
{
	char	*string;
	int		src_size;
	int		i;

	i = 0;
	while (src[src_size])
		src_size++;
	string = (char*)malloc(sizeof(*string) * (src_size));
	while (i < src_size)
	{
		string[i] = src[i];
		i++;
	}
	string[src_size] = '\0';
	return (string);
}





/* ************************************************************************** */
/* ******************************_ИЛИ_*************************************** */
/* ************************************************************************** */

#include <stdlib.h>

int		ft_strlen(char *str)
{
	int n;

	n = 0;
	while (str[n])
		n++;
	return (n);
}

char	*ft_strdup(char *src)
{
	char	*dest;
	int		i;
	int		l;

	l = ft_strlen(src);
	dest = (char*)malloc(sizeof(*dest) * (l + 1));
	i = 0;
	while (i < l)
	{
		dest[i] = src[i];
		i++;
	}
	dest[i] = '\0';
	return (dest);
}


/* ************************************************************************** */
/* ******************************_ИЛИ_*************************************** */
/* ************************************************************************** */

#include <stdlib.h>

char	ft_strlen(char *str)
{
	int nb;

	nb = 0;
	while (str[nb] != '\0')
	{
		nb++;
	}
	return (nb);
}

char	*ft_strdup(char *src)
{
	char	*str;
	int		taille_src;
	int		i;

	i = 0;
	taille_src = ft_strlen(src);
	str = (char*)malloc(sizeof(*str) * (taille_src + 1));
	while (i < taille_src)
	{
		str[i] = src[i];
		i++;
	}
	str[i] = '\0';
	return (str);
}


/* ************************************************************************** */
/* ******************************_ИЛИ_*************************************** */
/* ************************************************************************** */


char	*ft_strdup(char *src)
{
	char	*dst;
	int		i;

	i = 0;
	while (src[i])
		i++;
	if (!(dst = (char *)malloc(sizeof(char) * (i + 1))))
		return (NULL);
	i = -1;
	while (src[++i])
		dst[i] = src[i];
	dst[i] = '\0';
	return (dst);
}


/* ************************************************************************** */
/* ************************************************************************** */
/* ************************************************************************** */
