/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_list_push_back.c                                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/02/16 23:41:53 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** **
**
**  Каталог сдачи задания: ex04/
**  Файлы для сдачи: ft_list_push_back.c, ft_list.h
**  Разрешенные функции: ft_create_elem
**
** ************************************************************************** **
**
** 
**	• Создайте функцию "ft_list_push_back", которая добавляет новый элемент
**	типа "t_list" в конец списка.
** 
** 
**	• Он должен присваивать 'data' данному аргументу.
** 
** 
**	• При необходимости он обновит указатель в начале списка.
** 
** 
**	• Вот как эта функция должна быть объявлена :
**
**					void	ft_list_push_back(t_list **begin_list, void *data);
** 
** 
** ************************************************************************** */
/* ************************************************************************** */

#include "ft_list.h"

/* ************************************************************************** */

void	ft_list_push_back(t_list **begin_list, void *data)
{
	t_list	*list;

	if (*begin_list)
	{
		list = *begin_list;
		while (list->next)
			list = list->next;
		list->next = ft_create_elem(data);
	}
	else
		*begin_list = ft_create_elem(data);
}


/* ************************************************************************** */
/* ************************************************************************** */

#include "ft_list.h"

/* ************************************************************************** */

void	ft_list_push_back(t_list **begin_list, void *data)
{
	t_list *tmp;

	if (*begin_list)
	{
		tmp = *begin_list;
		while (tmp->next)
			tmp = tmp->next;
		tmp->next = ft_create_elem(data);
	}
}

/* ************************************************************************** */
/* ************************************************************************** */

#include "ft_list.h"

/* ************************************************************************** */

void	ft_list_push_back(t_list **begin_list, void *data)
{
	t_list *current;

	current = *begin_list;
	if (current == ((void *)0))
		*begin_list = ft_create_elem(data);
	else
	{
		while (current->next)
			current = current->next;
		current->next = ft_create_elem(data);
	}
}

/* ************************************************************************** */
/* ************************************************************************** */
